[{"id":494,"chapter":4,"verse":1,"Sahih_International":"O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah , through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer.","Yusuf_Ali":"O mankind! reverence your Guardian-Lord, who created you from a single person, created, of like nature, His mate, and from them twain scattered (like seeds) countless men and women;- reverence Allah, through whom ye demand your mutual (rights), and (reverence) the wombs (That bore you): for Allah ever watches over you.","Shakir":"O people! be careful of (your duty to) your Lord, Who created you from a single being and created its mate of the same (kind) and spread from these two, many men and women; and be careful of (your duty to) Allah, by Whom you demand one of another (your rights), and (to) the ties of relationship; surely Allah ever watches over you.","Muhammad_Sarwar":"People, have fear of your Lord who has created you from a single soul. From it He created your spouse and through them He populated the land with many men and women. Have fear of the One by whose Name you swear to settle your differences and have respect for your relatives. God certainly keeps watch over you.","Mohsin_Khan":"O mankind! Be dutiful to your Lord, Who created you from a single person (Adam), and from him (Adam) He created his wife [Hawwa (Eve)], and from them both He created many men and women and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever an All­Watcher over you.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women","eve","wife"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":495,"chapter":4,"verse":2,"Sahih_International":"And give to the orphans their properties and do not substitute the defective [of your own] for the good [of theirs]. And do not consume their properties into your own. Indeed, that is ever a great sin.","Yusuf_Ali":"To orphans restore their property (When they reach their age), nor substitute (your) worthless things for (their) good ones; and devour not their substance (by mixing it up) with your own. For this is indeed a great sin.","Shakir":"And give to the orphans their property, and do not substitute worthless (things) for (their) good (ones), and do not devour their property (as an addition) to your own property; this is surely a great crime.","Muhammad_Sarwar":"Give to the orphans their property. Do not exchange the pure for the filthy and do not spend the property of orphans along with your own; this would be a great sin.","Mohsin_Khan":"And give unto orphans their property and do not exchange (your) bad things for (their) good ones; and devour not their substance (by adding it) to your substance. Surely, this is a great sin.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":496,"chapter":4,"verse":3,"Sahih_International":"And if you fear that you will not deal justly with the orphan girls, then marry those that please you of [other] women, two or three or four. But if you fear that you will not be just, then [marry only] one or those your right hand possesses. That is more suitable that you may not incline [to injustice].","Yusuf_Ali":"If ye fear that ye shall not be able to deal justly with the orphans, Marry women of your choice, Two or three or four; but if ye fear that ye shall not be able to deal justly (with them), then only one, or (a captive) that your right hands possess, that will be more suitable, to prevent you from doing injustice.","Shakir":"And if you fear that you cannot act equitably towards orphans, then marry such women as seem good to you, two and three and four; but if you fear that you will not do justice (between them), then (marry) only one or what your right hands possess; this is more proper, that you may not deviate from the right course.","Muhammad_Sarwar":"With respect to marrying widows, if you are afraid of not being able to maintain justice with her children, marry another woman of your choice or two or three or four (who have no children). If you cannot maintain equality with more than one wife, marry only one or your slave-girl. This keeps you from acting against justice.","Mohsin_Khan":"And if you fear that you shall not be able to deal justly with the orphan­girls, then marry (other) women of your choice, two or three, or four but if you fear that you shall not be able to deal justly (with them), then only one or (the captives and the slaves) that your right hands possess. That is nearer to prevent you from doing injustice.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["her","woman","wife"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":497,"chapter":4,"verse":4,"Sahih_International":"And give the women [upon marriage] their [bridal] gifts graciously. But if they give up willingly to you anything of it, then take it in satisfaction and ease.","Yusuf_Ali":"And give the women (on marriage) their dower as a free gift; but if they, of their own good pleasure, remit any part of it to you, Take it and enjoy it with right good cheer.","Shakir":"And give women their dowries as a free gift, but if they of themselves be pleased to give up to you a portion of it, then eat it with enjoyment and with wholesome result.","Muhammad_Sarwar":"Pay the women their dowry as though it were a gift. However, if they allow you to keep a part of it as a favor to you, you may spend it with pleasure.","Mohsin_Khan":"And give to the women (whom you marry) their Mahr (obligatory bridal money given by the husband to his wife at the time of marriage) with a good heart, but if they, of their own good pleasure, remit any part of it to you, take it, and enjoy it without fear of any harm (as Allah has made it lawful).","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women","wife"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":498,"chapter":4,"verse":5,"Sahih_International":"And do not give the weak-minded your property, which Allah has made a means of sustenance for you, but provide for them with it and clothe them and speak to them words of appropriate kindness.","Yusuf_Ali":"To those weak of understanding Make not over your property, which Allah hath made a means of support for you, but feed and clothe them therewith, and speak to them words of kindness and justice.","Shakir":"And do not give away your property which Allah has made for you a (means of) support to the weak of understanding, and maintain them out of (the profits of) it, and clothe them and speak to them words of honest advice.","Muhammad_Sarwar":"Do not give to people weak of understanding your property for which God has made you to supervise. Feed and clothe such people and speak to them in a reasonable way.","Mohsin_Khan":"And give not unto the foolish your property which Allah has made a means of support for you, but feed and clothe them therewith, and speak to them words of kindness and justice.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":499,"chapter":4,"verse":6,"Sahih_International":"And test the orphans [in their abilities] until they reach marriageable age. Then if you perceive in them sound judgement, release their property to them. And do not consume it excessively and quickly, [anticipating] that they will grow up. And whoever, [when acting as guardian], is self-sufficient should refrain [from taking a fee]; and whoever is poor - let him take according to what is acceptable. Then when you release their property to them, bring witnesses upon them. And sufficient is Allah as Accountant.","Yusuf_Ali":"Make trial of orphans until they reach the age of marriage; if then ye find sound judgment in them, release their property to them; but consume it not wastefully, nor in haste against their growing up. If the guardian is well-off, Let him claim no remuneration, but if he is poor, let him have for himself what is just and reasonable. When ye release their property to them, take witnesses in their presence: But all-sufficient is Allah in taking account.","Shakir":"And test the orphans until they attain puberty; then if you find in them maturity of intellect, make over to them their property, and do not consume it extravagantly and hastily, lest they attain to full age; and whoever is rich, let him abstain altogether, and whoever is poor, let him eat reasonably; then when you make over to them their property, call witnesses in their presence; and Allah is enough as a Reckoner.","Muhammad_Sarwar":"Before returning orphan's property to them, make sure that they have reached maturity. Do not consume their property wastefully until such a time. The rich (guardian) should not take any of his ward's property. However, a poor (guardian) may use a reasonable portion. When you return their property, make sure you have witness. God is a perfect in taking accounts.","Mohsin_Khan":"And try orphans (as regards their intelligence) until they reach the age of marriage; if then you find sound judgement in them, release their property to them, but consume it not wastefully, and hastily fearing that they should grow up, and whoever amongst guardians is rich, he should take no wages, but if he is poor, let him have for himself what is just and reasonable (according to his work). And when you release their property to them, take witness in their presence; and Allah is All­Sufficient in taking account.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":500,"chapter":4,"verse":7,"Sahih_International":"For men is a share of what the parents and close relatives leave, and for women is a share of what the parents and close relatives leave, be it little or much - an obligatory share.","Yusuf_Ali":"From what is left by parents and those nearest related there is a share for men and a share for women, whether the property be small or large,-a determinate share.","Shakir":"Men shall have a portion of what the parents and the near relatives leave, and women shall have a portion of what the parents and the near relatives leave, whether there is little or much of it; a stated portion.","Muhammad_Sarwar":"Male and female are entitled to their legal share in the legacy of their parents and relatives, whether it be small or large.","Mohsin_Khan":"There is a share for men and a share for women from what is left by parents and those nearest related, whether, the property be small or large - a legal share.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["female"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":501,"chapter":4,"verse":8,"Sahih_International":"And when [other] relatives and orphans and the needy are present at the [time of] division, then provide for them [something] out of the estate and speak to them words of appropriate kindness.","Yusuf_Ali":"But if at the time of division other relatives, or orphans or poor, are present, feed them out of the (property), and speak to them words of kindness and justice.","Shakir":"And when there are present at the division the relatives and the orphans and the needy, give them (something) out of it and speak to them kind words.","Muhammad_Sarwar":"If relatives, orphans or destitute people, are present at the distribution of the legacy, give them something and speak kindly to them.","Mohsin_Khan":"And when the relatives and the orphans and Al­Masakin (the poor) are present at the time of division, give them out of the property, and speak to them words of kindness and justice.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":502,"chapter":4,"verse":9,"Sahih_International":"And let those [executors and guardians] fear [injustice] as if they [themselves] had left weak offspring behind and feared for them. So let them fear Allah and speak words of appropriate justice.","Yusuf_Ali":"Let those (disposing of an estate) have the same fear in their minds as they would have for their own if they had left a helpless family behind: Let them fear Allah, and speak words of appropriate (comfort).","Shakir":"And let those fear who, should they leave behind them weakly offspring, would fear on their account, so let them be careful of (their duty to) Allah, and let them speak right words.","Muhammad_Sarwar":"Those who are concerned about the welfare of their own children after their death, should have fear of God (when dealing with the orphans) and guide them properly.","Mohsin_Khan":"And let those (executors and guardians) have the same fear in their minds as they would have for their own, if they had left weak offspring behind. So let them fear Allah and speak right words.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":503,"chapter":4,"verse":10,"Sahih_International":"Indeed, those who devour the property of orphans unjustly are only consuming into their bellies fire. And they will be burned in a Blaze.","Yusuf_Ali":"Those who unjustly eat up the property of orphans, eat up a Fire into their own bodies: They will soon be enduring a Blazing Fire!","Shakir":"(As for) those who swallow the property of the orphans unjustly, surely they only swallow fire into their bellies and they shall enter burning fire.","Muhammad_Sarwar":"Those who wrongfully consume the property of orphans are, in fact, consuming fire in their bellies and they will suffer the blazing fire.","Mohsin_Khan":"Verily, those who unjustly eat up the property of orphans, they eat up only a fire into their bellies, and they will be burnt in the blazing Fire!","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":504,"chapter":4,"verse":11,"Sahih_International":"Allah instructs you concerning your children: for the male, what is equal to the share of two females. But if there are [only] daughters, two or more, for them is two thirds of one's estate. And if there is only one, for her is half. And for one's parents, to each one of them is a sixth of his estate if he left children. But if he had no children and the parents [alone] inherit from him, then for his mother is one third. And if he had brothers [or sisters], for his mother is a sixth, after any bequest he [may have] made or debt. Your parents or your children - you know not which of them are nearest to you in benefit. [These shares are] an obligation [imposed] by Allah. Indeed, Allah is ever Knowing and Wise.","Yusuf_Ali":"Allah (thus) directs you as regards your Children's (Inheritance): to the male, a portion equal to that of two females: if only daughters, two or more, their share is two-thirds of the inheritance; if only one, her share is a half. For parents, a sixth share of the inheritance to each, if the deceased left children; if no children, and the parents are the (only) heirs, the mother has a third; if the deceased Left brothers (or sisters) the mother has a sixth. (The distribution in all cases ('s) after the payment of legacies and debts. Ye know not whether your parents or your children are nearest to you in benefit. These are settled portions ordained by Allah; and Allah is All-knowing, Al-wise.","Shakir":"Allah enjoins you concerning your children: The male shall have the equal of the portion of two females; then if they are more than two females, they shall have two-thirds of what the deceased has left, and if there is one, she shall have the half; and as for his parents, each of them shall have the sixth of what he has left if he has a child, but if he has no child and (only) his two parents inherit him, then his mother shall have the third; but if he has brothers, then his mother shall have the sixth after (the payment of) a bequest he may have bequeathed or a debt; your parents and your children, you know not which of them is the nearer to you in usefulness; this is an ordinance from Allah: Surely Allah is Knowing, Wise.","Muhammad_Sarwar":"This is a commandment from your Lord: After the payment of debts or anything bequeathed, let the male inherit twice as much as the female. If there are more than two girls, they will have two-thirds of the legacy. If there is only one girl, she will inherit half of the legacy. Parents of the deceased will each inherit one-sixth of the legacy, if the deceased has a surviving child, however, if no children survive the deceased, and the heirs are the parents, the mother will receive one-third of the legacy. The mother will receive one-sixth of the legacy if the deceased has more than one surviving brother. These are the decreed shares according to the laws of God. Regardless of how you feel about your parents or children, you do not know which of them is more beneficial to you. God is All-knowing and All-wise.","Mohsin_Khan":"Allah commands you as regards your children's (inheritance); to the male, a portion equal to that of two females; if (there are) only daughters, two or more, their share is two thirds of the inheritance; if only one, her share is half. For parents, a sixth share of inheritance to each if the deceased left children; if no children, and the parents are the (only) heirs, the mother has a third; if the deceased left brothers or (sisters), the mother has a sixth. (The distribution in all cases is) after the payment of legacies he may have bequeathed or debts. You know not which of them, whether your parents or your children, are nearest to you in benefit, (these fixed shares) are ordained by Allah. And Allah is Ever All­Knower, All­Wise.","Sahih_International_tag":["daughters","her","sisters","mother"],"Sahih_International_found":true,"Yusuf_Ali_tag":["daughters","her","sisters","mother"],"Yusuf_Ali_found":true,"Shakir_tag":["mother","she"],"Shakir_found":true,"Muhammad_Sarwar_tag":["female","mother","she"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["daughters","her","sisters","mother"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":505,"chapter":4,"verse":12,"Sahih_International":"And for you is half of what your wives leave if they have no child. But if they have a child, for you is one fourth of what they leave, after any bequest they [may have] made or debt. And for the wives is one fourth if you leave no child. But if you leave a child, then for them is an eighth of what you leave, after any bequest you [may have] made or debt. And if a man or woman leaves neither ascendants nor descendants but has a brother or a sister, then for each one of them is a sixth. But if they are more than two, they share a third, after any bequest which was made or debt, as long as there is no detriment [caused]. [This is] an ordinance from Allah , and Allah is Knowing and Forbearing.","Yusuf_Ali":"In what your wives leave, your share is a half, if they leave no child; but if they leave a child, ye get a fourth; after payment of legacies and debts. In what ye leave, their share is a fourth, if ye leave no child; but if ye leave a child, they get an eighth; after payment of legacies and debts. If the man or woman whose inheritance is in question, has left neither ascendants nor descendants, but has left a brother or a sister, each one of the two gets a sixth; but if more than two, they share in a third; after payment of legacies and debts; so that no loss is caused (to any one). Thus is it ordained by Allah; and Allah is All-knowing, Most Forbearing.","Shakir":"And you shall have half of what your wives leave if they have no child, but if they have a child, then you shall have a fourth of what they leave after (payment of) any bequest they may have bequeathed or a debt; and they shall have the fourth of what you leave if you have no child, but if you have a child then they shall have the eighth of what you leave after (payment of) a bequest you may have bequeathed or a debt; and if a man or a woman leaves property to be inherited by neither parents nor offspring, and he (or she) has a brother or a sister, then each of them two shall have the sixth, but if they are more than that, they shall be sharers in the third after (payment of) any bequest that may have been bequeathed or a debt that does not harm (others); this is an ordinance from Allah: and Allah is Knowing, Forbearing.","Muhammad_Sarwar":"If your wives die without any surviving children, you will inherit half of their legacy. If they have children, you will inherit one-fourth of their legacy after the debts and things bequeathed have been excluded from the legacy. After the payment of debts and things bequeathed have been excluded from the legacy, your wives will inherit one-fourth of your legacy if you have no surviving children. If you leave a child, they will inherit one eighth of your legacy. If the deceased, either male or female, has no surviving heirs such as parents or children but has a brother or a sister, the brother or sister will each inherit one-sixth of the legacy. If there are more than just a brother or a sister, they will share one-third of the legacy. This is after the payment of any debts and things bequeathed have been excluded from the legacy, so that no one will be caused to suffer any loss. It is a guide from God, the All-knowing and Forbearing.","Mohsin_Khan":"In that which your wives leave, your share is a half if they have no child; but if they leave a child, you get a fourth of that which they leave after payment of legacies that they may have bequeathed or debts. In that which you leave, their (your wives) share is a fourth if you leave no child; but if you leave a child, they get an eighth of that which you leave after payment of legacies that you may have bequeathed or debts. If the man or woman whose inheritance is in question has left neither ascendants nor descendants, but has left a brother or a sister, each one of the two gets a sixth; but if more than two, they share in a third; after payment of lagacies he (or she) may have bequeathed or debts, so that no loss is caused (to anyone). This is a Commandment from Allah; and Allah is Ever All­Knowing, Most­Forbearing.","Sahih_International_tag":["sister","wives","woman"],"Sahih_International_found":true,"Yusuf_Ali_tag":["sister","wives","woman"],"Yusuf_Ali_found":true,"Shakir_tag":["sister","wives","woman","she"],"Shakir_found":true,"Muhammad_Sarwar_tag":["female","sister","wives"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["sister","wives","woman","she"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":506,"chapter":4,"verse":13,"Sahih_International":"These are the limits [set by] Allah , and whoever obeys Allah and His Messenger will be admitted by Him to gardens [in Paradise] under which rivers flow, abiding eternally therein; and that is the great attainment.","Yusuf_Ali":"Those are limits set by Allah: those who obey Allah and His Messenger will be admitted to Gardens with rivers flowing beneath, to abide therein (for ever) and that will be the supreme achievement.","Shakir":"These are Allah's limits, and whoever obeys Allah and His Messenger, He will cause him to enter gardens beneath which rivers flow, to abide in them; and this is the great achievement.","Muhammad_Sarwar":"These are the laws of God. Whoever obeys God and His Messenger will be admitted to the gardens wherein streams flow and wherein they will live forever. This is the greatest triumph.","Mohsin_Khan":"These are the limits (set by) Allah (or ordainments as regards laws of inheritance), and whosoever obeys Allah and His Messenger (Muhammad SAW) will be admitted to Gardens under which rivers flow (in Paradise), to abide therein, and that will be the great success.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":507,"chapter":4,"verse":14,"Sahih_International":"And whoever disobeys Allah and His Messenger and transgresses His limits - He will put him into the Fire to abide eternally therein, and he will have a humiliating punishment.","Yusuf_Ali":"But those who disobey Allah and His Messenger and transgress His limits will be admitted to a Fire, to abide therein: And they shall have a humiliating punishment.","Shakir":"And whoever disobeys Allah and His Messenger and goes beyond His limits, He will cause him to enter fire to abide in it, and he shall have an abasing chastisement.","Muhammad_Sarwar":"Whoever disobeys God and His Messenger and breaks His rules will be admitted to the fire wherein they will live forever, suffering a humiliating torment.","Mohsin_Khan":"And whosoever disobeys Allah and His Messenger (Muhammad SAW), and transgresses His limits, He will cast him into the Fire, to abide therein; and he shall have a disgraceful torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":508,"chapter":4,"verse":15,"Sahih_International":"Those who commit unlawful sexual intercourse of your women - bring against them four [witnesses] from among you. And if they testify, confine the guilty women to houses until death takes them or Allah ordains for them [another] way.","Yusuf_Ali":"If any of your women are guilty of lewdness, Take the evidence of four (Reliable) witnesses from amongst you against them; and if they testify, confine them to houses until death do claim them, or Allah ordain for them some (other) way.","Shakir":"And as for those who are guilty of an indecency from among your women, call to witnesses against them four (witnesses) from among you; then if they bear witness confine them to the houses until death takes them away or Allah opens some way for them.","Muhammad_Sarwar":"Those of your women who commit fornication, let four (Muslim) witness testify to their act. If there is sufficient testimony, confine them to their homes until they die, or until God provides a way for their freedom.","Mohsin_Khan":"And those of your women who commit illegal sexual intercourse, take the evidence of four witnesses from amongst you against them; and if they testify, confine them (i.e. women) to houses until death comes to them or Allah ordains for them some (other) way.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":509,"chapter":4,"verse":16,"Sahih_International":"And the two who commit it among you, dishonor them both. But if they repent and correct themselves, leave them alone. Indeed, Allah is ever Accepting of repentance and Merciful.","Yusuf_Ali":"If two men among you are guilty of lewdness, punish them both. If they repent and amend, Leave them alone; for Allah is Oft-returning, Most Merciful.","Shakir":"And as for the two who are guilty of indecency from among you, give them both a punishment; then if they repent and amend, turn aside from them; surely Allah is Oft-returning (to mercy), the Merciful.","Muhammad_Sarwar":"If any two people commit fornication, punish them. If they repent and reform, let them go. God is All-forgiving and All-merciful.","Mohsin_Khan":"And the two persons (man and woman) among you who commit illegal sexual intercourse, punish them both. And if they repent (promise Allah that they will never repeat, i.e. commit illegal sexual intercourse and other similar sins) and do righteous good deeds, leave them alone. Surely, Allah is Ever the One Who accepts repentance, (and He is) Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["woman"],"Mohsin_Khan_found":true,"total_found":1,"women_mentioned":true,"controversial":true},{"id":510,"chapter":4,"verse":17,"Sahih_International":"The repentance accepted by Allah is only for those who do wrong in ignorance [or carelessness] and then repent soon after. It is those to whom Allah will turn in forgiveness, and Allah is ever Knowing and Wise.","Yusuf_Ali":"Allah accept the repentance of those who do evil in ignorance and repent soon afterwards; to them will Allah turn in mercy: For Allah is full of knowledge and wisdom.","Shakir":"Repentance with Allah is only for those who do evil in ignorance, then turn (to Allah) soon, so these it is to whom Allah turns (mercifully), and Allah is ever Knowing, Wise.","Muhammad_Sarwar":"God will only accept the repentance of those who commit evil in ignorance, if they repent immediately. God is All-knowing and All-wise.","Mohsin_Khan":"Allah accepts only the repentance of those who do evil in ignorance and foolishness and repent soon afterwards; it is they to whom Allah will forgive and Allah is Ever All­Knower, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":511,"chapter":4,"verse":18,"Sahih_International":"But repentance is not [accepted] of those who [continue to] do evil deeds up until, when death comes to one of them, he says, \"Indeed, I have repented now,\" or of those who die while they are disbelievers. For them We have prepared a painful punishment.","Yusuf_Ali":"Of no effect is the repentance of those who continue to do evil, until death faces one of them, and he says, \"Now have I repented indeed;\" nor of those who die rejecting Faith: for them have We prepared a punishment most grievous.","Shakir":"And repentance is not for those who go on doing evil deeds, until when death comes to one of them, he says: Surely now I repent; nor (for) those who die while they are unbelievers. These are they for whom We have prepared a painful chastisement.","Muhammad_Sarwar":"There is no forgiveness for those who commit sin and do not repent until the last moment of their lives nor for those who die as unbelievers. For these people We have prepared a painful torment.","Mohsin_Khan":"And of no effect is the repentance of those who continue to do evil deeds until death faces one of them and he says: \"Now I repent;\" nor of those who die while they are disbelievers. For them We have prepared a painful torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":512,"chapter":4,"verse":19,"Sahih_International":"O you who have believed, it is not lawful for you to inherit women by compulsion. And do not make difficulties for them in order to take [back] part of what you gave them unless they commit a clear immorality. And live with them in kindness. For if you dislike them - perhaps you dislike a thing and Allah makes therein much good.","Yusuf_Ali":"O ye who believe! Ye are forbidden to inherit women against their will. Nor should ye treat them with harshness, that ye may Take away part of the dower ye have given them,-except where they have been guilty of open lewdness; on the contrary live with them on a footing of kindness and equity. If ye take a dislike to them it may be that ye dislike a thing, and Allah brings about through it a great deal of good.","Shakir":"O you who believe! it is not lawful for you that you should take women as heritage against (their) will, and do not straiten them in order that you may take part of what you have given them, unless they are guilty of manifest indecency, and treat them kindly; then if you hate them, it may be that you dislike a thing while Allah has placed abundant good in it.","Muhammad_Sarwar":"Believers, it is not lawful for you to inherit women against their will as part of the legacy. Do not create difficulties for your wives in order to force them to give-up part of what you had given to them to set themselves free from the bond of marriage, unless they have clearly committed adultery. Always treat them reasonably. If you dislike them, you could be disliking that which God has filled with abundant good.","Mohsin_Khan":"O you who believe! You are forbidden to inherit women against their will, and you should not treat them with harshness, that you may take away part of the Mahr you have given them, unless they commit open illegal sexual intercourse. And live with them honourably. If you dislike them, it may be that you dislike a thing and Allah brings through it a great deal of good.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women","wives"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":513,"chapter":4,"verse":20,"Sahih_International":"But if you want to replace one wife with another and you have given one of them a great amount [in gifts], do not take [back] from it anything. Would you take it in injustice and manifest sin?","Yusuf_Ali":"But if ye decide to take one wife in place of another, even if ye had given the latter a whole treasure for dower, Take not the least bit of it back: Would ye take it by slander and manifest wrong?","Shakir":"And if you wish to have (one) wife in place of another and you have given one of them a heap of gold, then take not from it anything; would you take it by slandering (her) and (doing her) manifest wrong?","Muhammad_Sarwar":"If you want to divorce a woman so that you can marry another, do not take back the dowry which you had paid even if what you paid was a large amount of gold. To do this is a slanderous act and a manifest sin.","Mohsin_Khan":"But if you intend to replace a wife by another and you have given one of them a Cantar (of gold i.e. a great amount) as Mahr, take not the least bit of it back; would you take it wrongfully without a right and (with) a manifest sin?","Sahih_International_tag":["wife"],"Sahih_International_found":true,"Yusuf_Ali_tag":["wife"],"Yusuf_Ali_found":true,"Shakir_tag":["her","wife"],"Shakir_found":true,"Muhammad_Sarwar_tag":["woman"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["wife"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":514,"chapter":4,"verse":21,"Sahih_International":"And how could you take it while you have gone in unto each other and they have taken from you a solemn covenant?","Yusuf_Ali":"And how could ye take it when ye have gone in unto each other, and they have Taken from you a solemn covenant?","Shakir":"And how can you take it when one of you has already gone in to the other and they have made with you a firm covenant?","Muhammad_Sarwar":"How can you take it back when you have had intimate relations and made a solemn agreement with each other?","Mohsin_Khan":"And how could you take it (back) while you have gone in unto each other, and they have taken from you a firm and strong covenant?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":515,"chapter":4,"verse":22,"Sahih_International":"And do not marry those [women] whom your fathers married, except what has already occurred. Indeed, it was an immorality and hateful [to Allah] and was evil as a way.","Yusuf_Ali":"And marry not women whom your fathers married,- except what is past: It was shameful and odious,- an abominable custom indeed.","Shakir":"And marry not woman whom your fathers married, except what has already passed; this surely is indecent and hateful, and it is an evil way.","Muhammad_Sarwar":"Do not marry, from now on, the ex-wives of your fathers for that custom was sinful, loathsome, and abominable.","Mohsin_Khan":"And marry not women whom your fathers married, except what has already passed; indeed it was shameful and most hateful, and an evil way.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["woman"],"Shakir_found":true,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":516,"chapter":4,"verse":23,"Sahih_International":"Prohibited to you [for marriage] are your mothers, your daughters, your sisters, your father's sisters, your mother's sisters, your brother's daughters, your sister's daughters, your [milk] mothers who nursed you, your sisters through nursing, your wives' mothers, and your step-daughters under your guardianship [born] of your wives unto whom you have gone in. But if you have not gone in unto them, there is no sin upon you. And [also prohibited are] the wives of your sons who are from your [own] loins, and that you take [in marriage] two sisters simultaneously, except for what has already occurred. Indeed, Allah is ever Forgiving and Merciful.","Yusuf_Ali":"Prohibited to you (For marriage) are:- Your mothers, daughters, sisters; father's sisters, Mother's sisters; brother's daughters, sister's daughters; foster-mothers (Who gave you suck), foster-sisters; your wives' mothers; your step-daughters under your guardianship, born of your wives to whom ye have gone in,- no prohibition if ye have not gone in;- (Those who have been) wives of your sons proceeding from your loins; and two sisters in wedlock at one and the same time, except for what is past; for Allah is Oft-forgiving, Most Merciful;-","Shakir":"Forbidden to you are your mothers and your daughters and your sisters and your paternal aunts and your maternal aunts and brothers' daughters and sisters' daughters and your mothers that have suckled you and your foster-sisters and mothers of your wives and your step-daughters who are in your guardianship, (born) of your wives to whom you have gone in, but if you have not gone in to them, there is no blame on you (in marrying them), and the wives of your sons who are of your own loins and that you should have two sisters together, except what has already passed; surely Allah is Forgiving, Merciful.","Muhammad_Sarwar":"You are forbidden to marry your mothers, daughters, sisters, paternal aunts, maternal aunts, nieces, your foster-mothers, your foster-sisters, your mothers-in-law, your step-daughters whom you have brought up and with whose mothers you have had carnal relations. It would not be a sin to marry her if you did not have carnal relations with her mother. You are forbidden to marry the wives of your own sons and to marry two sisters at the same time without any adverse affect to the such relations of the past. God is All-forgiving and All-merciful.","Mohsin_Khan":"Forbidden to you (for marriage) are: your mothers, your daughters, your sisters, your father's sisters, your mother's sisters, your brother's daughters, your sister's daughters, your foster mother who gave you suck, your foster milk suckling sisters, your wives' mothers, your step daughters under your guardianship, born of your wives to whom you have gone in - but there is no sin on you if you have not gone in them (to marry their daughters), - the wives of your sons who (spring) from your own loins, and two sisters in wedlock at the same time, except for what has already passed; verily, Allah is Oft­Forgiving, Most Merciful.","Sahih_International_tag":["daughters","sister","sisters","mothers","wives","mother"],"Sahih_International_found":true,"Yusuf_Ali_tag":["daughters","sister","sisters","mothers","wives","mother"],"Yusuf_Ali_found":true,"Shakir_tag":["daughters","sisters","aunts","mothers","wives"],"Shakir_found":true,"Muhammad_Sarwar_tag":["daughters","her","sisters","aunts","mothers","wives","mother"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["daughters","sister","sisters","mothers","wives","mother"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":517,"chapter":4,"verse":24,"Sahih_International":"And [also prohibited to you are all] married women except those your right hands possess. [This is] the decree of Allah upon you. And lawful to you are [all others] beyond these, [provided] that you seek them [in marriage] with [gifts from] your property, desiring chastity, not unlawful sexual intercourse. So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation. Indeed, Allah is ever Knowing and Wise.","Yusuf_Ali":"Also (prohibited are) women already married, except those whom your right hands possess: Thus hath Allah ordained (Prohibitions) against you: Except for these, all others are lawful, provided ye seek (them in marriage) with gifts from your property,- desiring chastity, not lust, seeing that ye derive benefit from them, give them their dowers (at least) as prescribed; but if, after a dower is prescribed, agree Mutually (to vary it), there is no blame on you, and Allah is All-knowing, All-wise.","Shakir":"And all married women except those whom your right hands possess (this is) Allah's ordinance to you, and lawful for you are (all women) besides those, provided that you seek (them) with your property, taking (them) in marriage not committing fornication. Then as to those whom you profit by, give them their dowries as appointed; and there is no blame on you about what you mutually agree after what is appointed; surely Allah is Knowing, Wise.","Muhammad_Sarwar":"You are forbidden to marry married women except your slave-girls. This is the decree of God. Besides these, it is lawful for you to marry other women if you pay their dower, maintain chastity and do not commit indecency. If you marry them for the appointed time you must pay their dowries. There is no harm if you reach an understanding among yourselves about the dowry, God is All-knowing and All-wise.","Mohsin_Khan":"Also (forbidden are) women already married, except those (captives and slaves) whom your right hands possess. Thus has Allah ordained for you. All others are lawful, provided you seek (them in marriage) with Mahr (bridal money given by the husband to his wife at the time of marriage) from your property, desiring chastity, not committing illegal sexual intercourse, so with those of whom you have enjoyed sexual relations, give them their Mahr as prescribed; but if after a Mahr is prescribed, you agree mutually (to give more), there is no sin on you. Surely, Allah is Ever All­Knowing, All­Wise.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women","wife"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":518,"chapter":4,"verse":25,"Sahih_International":"And whoever among you cannot [find] the means to marry free, believing women, then [he may marry] from those whom your right hands possess of believing slave girls. And Allah is most knowing about your faith. You [believers] are of one another. So marry them with the permission of their people and give them their due compensation according to what is acceptable. [They should be] chaste, neither [of] those who commit unlawful intercourse randomly nor those who take [secret] lovers. But once they are sheltered in marriage, if they should commit adultery, then for them is half the punishment for free [unmarried] women. This [allowance] is for him among you who fears sin, but to be patient is better for you. And Allah is Forgiving and Merciful.","Yusuf_Ali":"If any of you have not the means wherewith to wed free believing women, they may wed believing girls from among those whom your right hands possess: And Allah hath full knowledge about your faith. Ye are one from another: Wed them with the leave of their owners, and give them their dowers, according to what is reasonable: They should be chaste, not lustful, nor taking paramours: when they are taken in wedlock, if they fall into shame, their punishment is half that for free women. This (permission) is for those among you who fear sin; but it is better for you that ye practise self-restraint. And Allah is Oft-forgiving, Most Merciful.","Shakir":"And whoever among you has not within his power ampleness of means to marry free believing women, then (he may marry) of those whom your right hands possess from among your believing maidens; and Allah knows best your faith: you are (sprung) the one from the other; so marry them with the permission of their masters, and give them their dowries justly, they being chaste, not fornicating, nor receiving paramours; and when they are taken in marriage, then if they are guilty of indecency, they shall suffer half the punishment which is (inflicted) upon free women. This is for him among you who fears falling into evil; and that you abstain is better for you, and Allah is Forgiving, Merciful.","Muhammad_Sarwar":"If any of you do not have the means to marry a chaste believing woman, marry your believing slave-girls. God knows best about your faith. You have the same faith. Marry them with the permission of their masters and if they are chaste and have avoided fornication and amorous activities, give them their just dowries. If after marriage they commit adultery, they should receive half of the punishment of a free woman who has committed the same crime. This is for those who fear falling into evil. It is better for you to have self-control. God is All-forgiving and All-merciful.","Mohsin_Khan":"And whoever of you have not the means wherewith to wed free, believing women, they may wed believing girls from among those (captives and slaves) whom your right hands possess, and Allah has full knowledge about your Faith, you are one from another. Wed them with the permission of their own folk (guardians, Auliya' or masters) and give them their Mahr according to what is reasonable; they (the above said captive and slave-girls) should be chaste, not adulterous, nor taking boy-friends. And after they have been taken in wedlock, if they commit illegal sexual intercourse, their punishment is half that for free (unmarried) women. This is for him among you who is afraid of being harmed in his religion or in his body; but it is better for you that you practise self­restraint, and Allah is Oft­Forgiving, Most Merciful.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["woman"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":519,"chapter":4,"verse":26,"Sahih_International":"Allah wants to make clear to you [the lawful from the unlawful] and guide you to the [good] practices of those before you and to accept your repentance. And Allah is Knowing and Wise.","Yusuf_Ali":"Allah doth wish to make clear to you and to show you the ordinances of those before you; and (He doth wish to) turn to you (In Mercy): And Allah is All-knowing, All-wise.","Shakir":"Allah desires to explain to you, and to guide you into the ways of those before you, and to turn to you (mercifully), and Allah is Knowing, Wise.","Muhammad_Sarwar":"God wants to guide you, explain to you the customs of those who lived before you, and grant you forgiveness. He is All-knowing and All-wise.","Mohsin_Khan":"Allah wishes to make clear (what is lawful and what is unlawful) to you, and to show you the ways of those before you, and accept your repentance, and Allah is All­Knower, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":520,"chapter":4,"verse":27,"Sahih_International":"Allah wants to accept your repentance, but those who follow [their] passions want you to digress [into] a great deviation.","Yusuf_Ali":"Allah doth wish to Turn to you, but the wish of those who follow their lusts is that ye should turn away (from Him),- far, far away.","Shakir":"And Allah desires that He should turn to you (mercifully), and those who follow (their) lusts desire that you should deviate (with) a great deviation.","Muhammad_Sarwar":"God wants to be merciful to you but those who follow their evil desires seek to lead you astray.","Mohsin_Khan":"Allah wishes to accept your repentance, but those who follow their lusts, wish that you (believers) should deviate tremendously away from the Right Path.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":521,"chapter":4,"verse":28,"Sahih_International":"And Allah wants to lighten for you [your difficulties]; and mankind was created weak.","Yusuf_Ali":"Allah doth wish to lighten your (difficulties): For man was created Weak (in flesh).","Shakir":"Allah desires that He should make light your burdens, and man is created weak.","Muhammad_Sarwar":"God wants to relieve you of your burden; all human beings were created weak.","Mohsin_Khan":"Allah wishes to lighten (the burden) for you; and man was created weak (cannot be patient to leave sexual intercourse with woman).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["woman"],"Mohsin_Khan_found":true,"total_found":1,"women_mentioned":false,"controversial":false},{"id":522,"chapter":4,"verse":29,"Sahih_International":"O you who have believed, do not consume one another's wealth unjustly but only [in lawful] business by mutual consent. And do not kill yourselves [or one another]. Indeed, Allah is to you ever Merciful.","Yusuf_Ali":"O ye who believe! Eat not up your property among yourselves in vanities: But let there be amongst you Traffic and trade by mutual good-will: Nor kill (or destroy) yourselves: for verily Allah hath been to you Most Merciful!","Shakir":"O you who believe! do not devour your property among yourselves falsely, except that it be trading by your mutual consent; and do not kill your people; surely Allah is Merciful to you.","Muhammad_Sarwar":"Believers, do not exchange your property in wrongful ways unless it is in trade by mutual agreement. Do not kill one another. God is All-merciful to you.","Mohsin_Khan":"O you who believe! Eat not up your property among yourselves unjustly except it be a trade amongst you, by mutual consent. And do not kill yourselves (nor kill one another). Surely, Allah is Most Merciful to you.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":523,"chapter":4,"verse":30,"Sahih_International":"And whoever does that in aggression and injustice - then We will drive him into a Fire. And that, for Allah , is [always] easy.","Yusuf_Ali":"If any do that in rancour and injustice,- soon shall We cast them into the Fire: And easy it is for Allah.","Shakir":"And whoever does this aggressively and unjustly, We will soon cast him into fire; and this is easy to Allah.","Muhammad_Sarwar":"Whoever commits murder out of animosity and injustice will be burnt in hell fire. This is a very easy thing for God to do.","Mohsin_Khan":"And whoever commits that through aggression and injustice, We shall cast him into the Fire, and that is easy for Allah.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":524,"chapter":4,"verse":31,"Sahih_International":"If you avoid the major sins which you are forbidden, We will remove from you your lesser sins and admit you to a noble entrance [into Paradise].","Yusuf_Ali":"If ye (but) eschew the most heinous of the things which ye are forbidden to do, We shall expel out of you all the evil in you, and admit you to a gate of great honour.","Shakir":"If you shun the great sins which you are forbidden, We will do away with your small sins and cause you to enter an honorable place of entering.","Muhammad_Sarwar":"If you avoid violating that which has been prohibited, your (lesser) sins will be forgiven and you will be admitted into an exalted dwelling.","Mohsin_Khan":"If you avoid the great sins which you are forbidden to do, We shall remit from you your (small) sins, and admit you to a Noble Entrance (i.e. Paradise).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":525,"chapter":4,"verse":32,"Sahih_International":"And do not wish for that by which Allah has made some of you exceed others. For men is a share of what they have earned, and for women is a share of what they have earned. And ask Allah of his bounty. Indeed Allah is ever, of all things, Knowing.","Yusuf_Ali":"And in no wise covet those things in which Allah Hath bestowed His gifts More freely on some of you than on others: To men is allotted what they earn, and to women what they earn: But ask Allah of His bounty. For Allah hath full knowledge of all things.","Shakir":"And do not covet that by which Allah has made some of you excel others; men shall have the benefit of what they earn and women shall have the benefit of what they earn; and ask Allah of His grace; surely Allah knows all things.","Muhammad_Sarwar":"Do not envy the favors which God has granted to some of you. Men and women will both be rewarded according to their deeds, rather pray to God for His favors. God knows all things.","Mohsin_Khan":"And wish not for the things in which Allah has made some of you to excel others. For men there is reward for what they have earned, (and likewise) for women there is reward for what they have earned, and ask Allah of His Bounty. Surely, Allah is Ever All­Knower of everything.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":526,"chapter":4,"verse":33,"Sahih_International":"And for all, We have made heirs to what is left by parents and relatives. And to those whom your oaths have bound [to you] - give them their share. Indeed Allah is ever, over all things, a Witness.","Yusuf_Ali":"To (benefit) every one, We have appointed shares and heirs to property left by parents and relatives. To those, also, to whom your right hand was pledged, give their due portion. For truly Allah is witness to all things.","Shakir":"And to every one We have appointed heirs of what parents and near relatives leave; and as to those with whom your rights hands have ratified agreements, give them their portion; surely Allah is a witness over all things.","Muhammad_Sarwar":"We have chosen heirs for every legacy that parents and relatives may leave. Let those who have been promised a bequest receive their share of the legacy. God is Omnipresent.","Mohsin_Khan":"And to everyone, We have appointed heirs of that (property) left by parents and relatives. To those also with whom you have made a pledge (brotherhood), give them their due portion (by Wasiya ­ wills, etc.). Truly, Allah is Ever a Witness over all things.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":527,"chapter":4,"verse":34,"Sahih_International":"Men are in charge of women by [right of] what Allah has given one over the other and what they spend [for maintenance] from their wealth. So righteous women are devoutly obedient, guarding in [the husband's] absence what Allah would have them guard. But those [wives] from whom you fear arrogance - [first] advise them; [then if they persist], forsake them in bed; and [finally], strike them. But if they obey you [once more], seek no means against them. Indeed, Allah is ever Exalted and Grand.","Yusuf_Ali":"Men are the protectors and maintainers of women, because Allah has given the one more (strength) than the other, and because they support them from their means. Therefore the righteous women are devoutly obedient, and guard in (the husband's) absence what Allah would have them guard. As to those women on whose part ye fear disloyalty and ill-conduct, admonish them (first), (Next), refuse to share their beds, (And last) beat them (lightly); but if they return to obedience, seek not against them Means (of annoyance): For Allah is Most High, great (above you all).","Shakir":"Men are the maintainers of women because Allah has made some of them to excel others and because they spend out of their property; the good women are therefore obedient, guarding the unseen as Allah has guarded; and (as to) those on whose part you fear desertion, admonish them, and leave them alone in the sleeping-places and beat them; then if they obey you, do not seek a way against them; surely Allah is High, Great.","Muhammad_Sarwar":"Men are the protectors of women because of the greater preference that God has given to some of them and because they financially support them. Among virtuous women are those who are steadfast in prayer and dependable in keeping the secrets that God has protected. Admonish women who disobey (God's laws), do not sleep with them and beat them. If they obey (the laws of God), do not try to find fault in them. God is High and Supreme.","Mohsin_Khan":"Men are the protectors and maintainers of women, because Allah has made one of them to excel the other, and because they spend (to support them) from their means. Therefore the righteous women are devoutly obedient (to Allah and to their husbands), and guard in the husband's absence what Allah orders them to guard (e.g. their chastity, their husband's property, etc.). As to those women on whose part you see ill­conduct, admonish them (first), (next), refuse to share their beds, (and last) beat them (lightly, if it is useful), but if they return to obedience, seek not against them means (of annoyance). Surely, Allah is Ever Most High, Most Great.","Sahih_International_tag":["women","wives"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":528,"chapter":4,"verse":35,"Sahih_International":"And if you fear dissension between the two, send an arbitrator from his people and an arbitrator from her people. If they both desire reconciliation, Allah will cause it between them. Indeed, Allah is ever Knowing and Acquainted [with all things].","Yusuf_Ali":"If ye fear a breach between them twain, appoint (two) arbiters, one from his family, and the other from hers; if they wish for peace, Allah will cause their reconciliation: For Allah hath full knowledge, and is acquainted with all things.","Shakir":"And if you fear a breach between the two, then appoint judge from his people and a judge from her people; if they both desire agreement, Allah will effect harmony between them, surely Allah is Knowing, Aware.","Muhammad_Sarwar":"If there appears to be discord between a wife and her husband and if they desire reconciliation choose arbiters from the families of both sides. God will bring them together; God is All-knowing and All-aware.","Mohsin_Khan":"If you fear a breach between them twain (the man and his wife), appoint (two) arbitrators, one from his family and the other from her's; if they both wish for peace, Allah will cause their reconciliation. Indeed Allah is Ever All­Knower, Well­Acquainted with all things.","Sahih_International_tag":["her"],"Sahih_International_found":true,"Yusuf_Ali_tag":["hers"],"Yusuf_Ali_found":true,"Shakir_tag":["her"],"Shakir_found":true,"Muhammad_Sarwar_tag":["her","wife"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["her","wife"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":529,"chapter":4,"verse":36,"Sahih_International":"Worship Allah and associate nothing with Him, and to parents do good, and to relatives, orphans, the needy, the near neighbor, the neighbor farther away, the companion at your side, the traveler, and those whom your right hands possess. Indeed, Allah does not like those who are self-deluding and boastful.","Yusuf_Ali":"Serve Allah, and join not any partners with Him; and do good- to parents, kinsfolk, orphans, those in need, neighbours who are near, neighbours who are strangers, the companion by your side, the wayfarer (ye meet), and what your right hands possess: For Allah loveth not the arrogant, the vainglorious;-","Shakir":"And serve Allah and do not associate any thing with Him and be good to the parents and to the near of kin and the orphans and the needy and the neighbor of (your) kin and the alien neighbor, and the companion in a journey and the wayfarer and those whom your right hands possess; surely Allah does not love him who is proud, boastful;","Muhammad_Sarwar":"Worship God and consider no one equal to Him. Be kind to your parents, relatives, orphans, the destitute, your near and distant neighbors, your companions, wayfarers, and your slaves. God does not love the proud and boastful ones,","Mohsin_Khan":"Worship Allah and join none with Him in worship, and do good to parents, kinsfolk, orphans, Al-Masakin (the poor), the neighbour who is near of kin, the neighbour who is a stranger, the companion by your side, the wayfarer (you meet), and those (slaves) whom your right hands possess. Verily, Allah does not like such as are proud and boastful;","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":530,"chapter":4,"verse":37,"Sahih_International":"Who are stingy and enjoin upon [other] people stinginess and conceal what Allah has given them of His bounty - and We have prepared for the disbelievers a humiliating punishment -","Yusuf_Ali":"(Nor) those who are niggardly or enjoin niggardliness on others, or hide the bounties which Allah hath bestowed on them; for We have prepared, for those who resist Faith, a punishment that steeps them in contempt;-","Shakir":"Those who are niggardly and bid people to be niggardly and hide what Allah has given them out of His grace; and We have prepared for the unbelievers a disgraceful chastisement.","Muhammad_Sarwar":"the stingy ones who try to make others stingy or those who hide the favors that God has bestowed on them. We have prepared a humiliating torment for the disbelievers,","Mohsin_Khan":"Those who are miserly and enjoin miserliness on other men and hide what Allah has bestowed upon them of His Bounties. And We have prepared for the disbelievers a disgraceful torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":531,"chapter":4,"verse":38,"Sahih_International":"And [also] those who spend of their wealth to be seen by the people and believe not in Allah nor in the Last Day. And he to whom Satan is a companion - then evil is he as a companion.","Yusuf_Ali":"Not those who spend of their substance, to be seen of men, but have no faith in Allah and the Last Day: If any take the Evil One for their intimate, what a dreadful intimate he is!","Shakir":"And those who spend their property (in alms) to be seen of the people and do not believe in Allah nor in the last day; and as for him whose associate is the Shaitan, an evil associate is he!","Muhammad_Sarwar":"those who spend their property out of a desire to show off and not because of their belief in God and the Day of Judgment, and (lastly) those who choose Satan for a friend; what an evil friend!","Mohsin_Khan":"And (also) those who spend of their substance to be seen of men, and believe not in Allah and the Last Day [they are the friends of Shaitan (Satan)], and whoever takes Shaitan (Satan) as an intimate; then what a dreadful intimate he has!","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":532,"chapter":4,"verse":39,"Sahih_International":"And what [harm would come] upon them if they believed in Allah and the Last Day and spent out of what Allah provided for them? And Allah is ever, about them, Knowing.","Yusuf_Ali":"And what burden Were it on them if they had faith in Allah and in the Last Day, and they spent out of what Allah hath given them for sustenance? For Allah hath full knowledge of them.","Shakir":"And what (harm) would it have done them if they had believed in Allah and the last day and spent (benevolently) of what Allah had given them? And Allah knows them.","Muhammad_Sarwar":"How could it have harmed them if they had believed in God and the Last Day and spent their property for the cause of God? God knows them very well","Mohsin_Khan":"And what loss have they if they had believed in Allah and in the Last Day, and they spend out of what Allah has given them for sustenance? And Allah is Ever All­Knower of them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":533,"chapter":4,"verse":40,"Sahih_International":"Indeed, Allah does not do injustice, [even] as much as an atom's weight; while if there is a good deed, He multiplies it and gives from Himself a great reward.","Yusuf_Ali":"Allah is never unjust in the least degree: If there is any good (done), He doubleth it, and giveth from His own presence a great reward.","Shakir":"Surely Allah does not do injustice to the weight of an atom, and if it is a good deed He multiplies it and gives from Himself a great reward.","Muhammad_Sarwar":"God does not do even an atom's weight of injustice. A good deed is multiplied by God and richly rewarded.","Mohsin_Khan":"Surely! Allah wrongs not even of the weight of an atom (or a small ant), but if there is any good (done), He doubles it, and gives from Him a great reward.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":534,"chapter":4,"verse":41,"Sahih_International":"So how [will it be] when We bring from every nation a witness and we bring you, [O Muhammad] against these [people] as a witness?","Yusuf_Ali":"How then if We brought from each people a witness, and We brought thee as a witness against these people!","Shakir":"How will it be, then, when We bring from every people a witness and bring you as a witness against these?","Muhammad_Sarwar":"How will it be when We call for a witness from every nation and have you, (Muhammad), testify against them all?","Mohsin_Khan":"How (will it be) then, when We bring from each nation a witness and We bring you (O Muhammad SAW) as a witness against these people?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":535,"chapter":4,"verse":42,"Sahih_International":"That Day, those who disbelieved and disobeyed the Messenger will wish they could be covered by the earth. And they will not conceal from Allah a [single] statement.","Yusuf_Ali":"On that day those who reject Faith and disobey the messenger will wish that the earth Were made one with them: But never will they hide a single fact from Allah!","Shakir":"On that day will those who disbelieve and disobey the Messenger desire that the earth were levelled with them, and they shall not hide any word from Allah.","Muhammad_Sarwar":"At that time the disbelievers who disobeyed the Messenger will wish that they could be turned into dust and they will be able to hide nothing from God.","Mohsin_Khan":"On that day those who disbelieved and disobeyed the Messenger (Muhammad SAW) will wish that they were buried in the earth, but they will never be able to hide a single fact from Allah.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":536,"chapter":4,"verse":43,"Sahih_International":"O you who have believed, do not approach prayer while you are intoxicated until you know what you are saying or in a state of janabah, except those passing through [a place of prayer], until you have washed [your whole body]. And if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and find no water, then seek clean earth and wipe over your faces and your hands [with it]. Indeed, Allah is ever Pardoning and Forgiving.","Yusuf_Ali":"O ye who believe! Approach not prayers with a mind befogged, until ye can understand all that ye say,- nor in a state of ceremonial impurity (Except when travelling on the road), until after washing your whole body. If ye are ill, or on a journey, or one of you cometh from offices of nature, or ye have been in contact with women, and ye find no water, then take for yourselves clean sand or earth, and rub therewith your faces and hands. For Allah doth blot out sins and forgive again and again.","Shakir":"O you who believe! do not go near prayer when you are Intoxicated until you know (well) what you say, nor when you are under an obligation to perform a bath-- unless (you are) travelling on the road-- until you have washed yourselves; and if you are sick, or on a journey, or one of you come from the privy or you have touched the women, and you cannot find water, betake yourselves to pure earth, then wipe your faces and your hands; surely Allah is Pardoning, Forgiving.","Muhammad_Sarwar":"Believers, do not pray when you are drunk, but, instead, wait until you can understand what you say. Also, do not pray when you have experienced a seminal discharge until after you have taken a bath, unless you are on a journey. If, while sick or on a journey, you can find no water after having defecated or after having had carnal relations, perform tayammum by touching your palms on the pure earth and wipe the (upper part of) your face and the backs of your hands. God is Gracious and All-forgiving.","Mohsin_Khan":"O you who believe! Approach not As­Salat (the prayer) when you are in a drunken state until you know (the meaning) of what you utter, nor when you are in a state of Janaba, (i.e. in a state of sexual impurity and have not yet taken a bath) except when travelling on the road (without enough water, or just passing through a mosque), till you wash your whole body. And if you are ill, or on a journey, or one of you comes after answering the call of nature, or you have been in contact with women (by sexual relations) and you find no water, perform Tayammum with clean earth and rub therewith your faces and hands (Tayammum). Truly, Allah is Ever Oft­Pardoning, Oft­Forgiving.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":537,"chapter":4,"verse":44,"Sahih_International":"Have you not seen those who were given a portion of the Scripture, purchasing error [in exchange for it] and wishing you would lose the way?","Yusuf_Ali":"Hast thou not turned Thy vision to those who were given a portion of the Book? they traffic in error, and wish that ye should lose the right path.","Shakir":"Have you not considered those to whom a portion of the Book has been given? They buy error and desire that you should go astray from the way.","Muhammad_Sarwar":"Have you seen those who had received a portion of the Book trade misguidance and try to make you, too, go astray?","Mohsin_Khan":"Have you not seen those who were given a portion of the book (the Jews), purchasing the wrong path, and wish that you should go astray from the Right Path.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":538,"chapter":4,"verse":45,"Sahih_International":"And Allah is most knowing of your enemies; and sufficient is Allah as an ally, and sufficient is Allah as a helper.","Yusuf_Ali":"But Allah hath full knowledge of your enemies: Allah is enough for a protector, and Allah is enough for a Helper.","Shakir":"And Allah best knows your enemies; and Allah suffices as a Guardian, and Allah suffices as a Helper.","Muhammad_Sarwar":"God knows who are your enemies. You need to have no guardian or helper other than God.","Mohsin_Khan":"Allah has full knowledge of your enemies, and Allah is Sufficient as a Wali (Protector), and Allah is Sufficient as a Helper.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":539,"chapter":4,"verse":46,"Sahih_International":"Among the Jews are those who distort words from their [proper] usages and say, \"We hear and disobey\" and \"Hear but be not heard\" and \"Ra'ina,\" twisting their tongues and defaming the religion. And if they had said [instead], \"We hear and obey\" and \"Wait for us [to understand],\" it would have been better for them and more suitable. But Allah has cursed them for their disbelief, so they believe not, except for a few.","Yusuf_Ali":"Of the Jews there are those who displace words from their (right) places, and say: \"We hear and we disobey\"; and \"Hear what is not Heard\"; and \"Ra'ina\"; with a twist of their tongues and a slander to Faith. If only they had said: \"What hear and we obey\"; and \"Do hear\"; and \"Do look at us\"; it would have been better for them, and more proper; but Allah hath cursed them for their Unbelief; and but few of them will believe.","Shakir":"Of those who are Jews (there are those who) alter words from their places and say: We have heard and we disobey and: Hear, may you not be made to hear! and: Raina, distorting (the word) with their tongues and taunting about religion; and if they had said (instead): We have heard and we obey, and hearken, and unzurna it would have been better for them and more upright; but Allah has cursed them on account of their unbelief, so they do not believe but a little.","Muhammad_Sarwar":"Some Jews take certain words out of context and by twisting their tongues to make a jest out of the true religion, say, \"We heard and (in our hearts ) disobeyed. (Muhammad) ra`ina (be kind to us) but they intend thereby (the meaning in their own language): \"Listen! May God turn you deaf.\" They should have said, \"We heard and obeyed. (Muhammad) listen and consider our question.\" This would have been better for them and more righteous. God has condemned them for their disbelief, thus, no one, except a few among them, will have faith.","Mohsin_Khan":"Among those who are Jews, there are some who displace words from (their) right places and say: \"We hear your word (O Muhammad SAW ) and disobey,\" and \"Hear and let you (O Muhammad SAW) hear nothing.\" And Ra'ina with a twist of their tongues and as a mockery of the religion (Islam). And if only they had said: \"We hear and obey\", and \"Do make us understand,\" it would have been better for them, and more proper, but Allah has cursed them for their disbelief, so they believe not except a few.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":540,"chapter":4,"verse":47,"Sahih_International":"O you who were given the Scripture, believe in what We have sent down [to Muhammad], confirming that which is with you, before We obliterate faces and turn them toward their backs or curse them as We cursed the sabbath-breakers. And ever is the decree of Allah accomplished.","Yusuf_Ali":"O ye People of the Book! believe in what We have (now) revealed, confirming what was (already) with you, before We change the face and fame of some (of you) beyond all recognition, and turn them hindwards, or curse them as We cursed the Sabbath-breakers, for the decision of Allah Must be carried out.","Shakir":"O you who have been given the Book! believe that which We have revealed, verifying what you have, before We alter faces then turn them on their backs, or curse them as We cursed the violaters of the Sabbath, and the command of Allah shall be executed.","Muhammad_Sarwar":"People of the Book, have faith in the Quran that We have revealed to confirm your Book, before certain faces are changed and turned back. We shall condemn them as We did the people of the Sabbath about whom God's decree had decisively been ordained.","Mohsin_Khan":"O you who have been given the Scripture (Jews and Christians)! Believe in what We have revealed (to Muhammad SAW) confirming what is (already) with you, before We efface faces (by making them like the back of necks; without nose, mouth, eyes, etc.) and turn them hindwards, or curse them as We cursed the Sabbath­breakers. And the Commandment of Allah is always executed.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":541,"chapter":4,"verse":48,"Sahih_International":"Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly fabricated a tremendous sin.","Yusuf_Ali":"Allah forgiveth not that partners should be set up with Him; but He forgiveth anything else, to whom He pleaseth; to set up partners with Allah is to devise a sin Most heinous indeed.","Shakir":"Surely Allah does not forgive that anything should be associated with Him, and forgives what is besides that to whomsoever He pleases; and whoever associates anything with Allah, he devises indeed a great sin.","Muhammad_Sarwar":"God does not forgive the sin of considering others equal to Him, but He may choose to forgive other sins. Whoever believes in other gods besides Him has indulged in a great sin.","Mohsin_Khan":"Verily, Allah forgives not that partners should be set up with him in worship, but He forgives except that (anything else) to whom He pleases, and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":542,"chapter":4,"verse":49,"Sahih_International":"Have you not seen those who claim themselves to be pure? Rather, Allah purifies whom He wills, and injustice is not done to them, [even] as much as a thread [inside a date seed].","Yusuf_Ali":"Hast thou not turned Thy vision to those who claim sanctity for themselves? Nay-but Allah Doth sanctify whom He pleaseth. But never will they fail to receive justice in the least little thing.","Shakir":"Have you not considered those who attribute purity to themselves? Nay, Allah purifies whom He pleases; and they shall not be wronged the husk of a date stone.","Muhammad_Sarwar":"(Muhammad), have you seen those who try to purify themselves? They should know that God only purifies whomever He wants and that the slightest wrong will not be done to such people.","Mohsin_Khan":"Have you not seen those who claim sanctity for themselves. Nay - but Allah sanctifies whom He pleases, and they will not be dealt with injustice even equal to the extent of a Fatila (A scalish thread in the long slit of a date­stone).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":543,"chapter":4,"verse":50,"Sahih_International":"Look how they invent about Allah untruth, and sufficient is that as a manifest sin.","Yusuf_Ali":"Behold! how they invent a lie against Allah! but that by itself is a manifest sin!","Shakir":"See how they forge the lie against Allah, and this is sufficient as a manifest sin.","Muhammad_Sarwar":"Consider how they create lies about God? This alone is a grave sin.","Mohsin_Khan":"Look, how they invent a lie against Allah, and enough is that as a manifest sin.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":544,"chapter":4,"verse":51,"Sahih_International":"Have you not seen those who were given a portion of the Scripture, who believe in superstition and false objects of worship and say about the disbelievers, \"These are better guided than the believers as to the way\"?","Yusuf_Ali":"Hast thou not turned Thy vision to those who were given a portion of the Book? they believe in sorcery and Evil, and say to the Unbelievers that they are better guided in the (right) way Than the believers!","Shakir":"Have you not seen those to whom a portion of the Book has been given? They believe in idols and false deities and say of those who disbelieve: These are better guided in the path than those who believe.","Muhammad_Sarwar":"Have you seen how those who had been given a share of the Book believe in idols and Satan and who say, \"The disbelievers are better guided than the believers\".","Mohsin_Khan":"Have you not seen those who were given a portion of the Scripture? They believe in Jibt and Taghut and say to the disbelievers that they are better guided as regards the way than the believers (Muslims).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":545,"chapter":4,"verse":52,"Sahih_International":"Those are the ones whom Allah has cursed; and he whom Allah curses - never will you find for him a helper.","Yusuf_Ali":"They are (men) whom Allah hath cursed: And those whom Allah Hath cursed, thou wilt find, have no one to help.","Shakir":"Those are they whom Allah has cursed, and whomever Allah curses you shall not find any helper for him.","Muhammad_Sarwar":"God has condemned them. No one can help one who has been condemned by God.","Mohsin_Khan":"They are those whom Allah has cursed, and he whom Allah curses, you will not find for him (any) helper,","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":546,"chapter":4,"verse":53,"Sahih_International":"Or have they a share of dominion? Then [if that were so], they would not give the people [even as much as] the speck on a date seed.","Yusuf_Ali":"Have they a share in dominion or power? Behold, they give not a farthing to their fellow-men?","Shakir":"Or have they a share in the kingdom? But then they would not give to people even the speck in the date stone.","Muhammad_Sarwar":"Even if they had a share in the Kingdom (Divine authority), they would not have given the smallest thing to anyone.","Mohsin_Khan":"Or have they a share in the dominion? Then in that case they would not give mankind even a Naqira (speck on the back of a date-stone).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":547,"chapter":4,"verse":54,"Sahih_International":"Or do they envy people for what Allah has given them of His bounty? But we had already given the family of Abraham the Scripture and wisdom and conferred upon them a great kingdom.","Yusuf_Ali":"Or do they envy mankind for what Allah hath given them of his bounty? but We had already given the people of Abraham the Book and Wisdom, and conferred upon them a great kingdom.","Shakir":"Or do they envy the people for what Allah has given them of His grace? But indeed We have given to Ibrahim's children the Book and the wisdom, and We have given them a grand kingdom.","Muhammad_Sarwar":"Are they jealous of the favors that God has done to some people? We have given to the family of Abraham the Book, Wisdom, and a great Kingdom.","Mohsin_Khan":"Or do they envy men (Muhammad SAW and his followers) for what Allah has given them of His Bounty? Then We had already given the family of Ibrahim (Abraham) the Book and Al­Hikmah (As­Sunnah - Divine Inspiration to those Prophets not written in the form of a book), and conferred upon them a great kingdom.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":548,"chapter":4,"verse":55,"Sahih_International":"And some among them believed in it, and some among them were averse to it. And sufficient is Hell as a blaze.","Yusuf_Ali":"Some of them believed, and some of them averted their faces from him: And enough is Hell for a burning fire.","Shakir":"So of them is he who believes in him, and of them is he who turns away from him, and hell is sufficient to burn.","Muhammad_Sarwar":"Some have believed, others have disbelieved and tried to prevent people from believing. For these people, only the intense fire of hell is a sufficient punishment.","Mohsin_Khan":"Of them were (some) who believed in him (Muhammad SAW), and of them were (some) who averted their faces from him (Muhammad SAW); and enough is Hell for burning (them).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":549,"chapter":4,"verse":56,"Sahih_International":"Indeed, those who disbelieve in Our verses - We will drive them into a Fire. Every time their skins are roasted through We will replace them with other skins so they may taste the punishment. Indeed, Allah is ever Exalted in Might and Wise.","Yusuf_Ali":"Those who reject our Signs, We shall soon cast into the Fire: as often as their skins are roasted through, We shall change them for fresh skins, that they may taste the penalty: for Allah is Exalted in Power, Wise.","Shakir":"(As for) those who disbelieve in Our communications, We shall make them enter fire; so oft as their skins are thoroughly burned, We will change them for other skins, that they may taste the chastisement; surely Allah is Mighty, Wise.","Muhammad_Sarwar":"We will make the rejectors of Our revelations suffer in hell fire. As soon as the fire destroys their skins, We will give them new skins so that they may suffer more of the torment. God is Majestic and All-wise.","Mohsin_Khan":"Surely! Those who disbelieved in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) We shall burn them in Fire. As often as their skins are roasted through, We shall change them for other skins that they may taste the punishment. Truly, Allah is Ever Most Powerful, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":550,"chapter":4,"verse":57,"Sahih_International":"But those who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they abide forever. For them therein are purified spouses, and We will admit them to deepening shade.","Yusuf_Ali":"But those who believe and do deeds of righteousness, We shall soon admit to Gardens, with rivers flowing beneath,- their eternal home: Therein shall they have companions pure and holy: We shall admit them to shades, cool and ever deepening.","Shakir":"And (as for) those who believe and do good deeds, We will make them enter gardens beneath which rivers flow, to abide in them for ever; they shall have therein pure mates, and We shall make them enter a dense shade.","Muhammad_Sarwar":"We will admit the righteously striving believers into the gardens wherein streams flow. They will live therein forever in a cool shade with their pure spouses.","Mohsin_Khan":"But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to Gardens under which rivers flow (Paradise), abiding therein forever. Therein they shall have Azwajun Mutahharatun [purified mates or wives (having no menses, stools, urine, etc.)] and We shall admit them to shades wide and ever deepening (Paradise).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["wives"],"Mohsin_Khan_found":true,"total_found":1,"women_mentioned":true,"controversial":true},{"id":551,"chapter":4,"verse":58,"Sahih_International":"Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.","Yusuf_Ali":"Allah doth command you to render back your Trusts to those to whom they are due; And when ye judge between man and man, that ye judge with justice: Verily how excellent is the teaching which He giveth you! For Allah is He Who heareth and seeth all things.","Shakir":"Surely Allah commands you to make over trusts to their owners and that when you judge between people you judge with justice; surely Allah admonishes you with what is excellent; surely Allah is Seeing, Hearing.","Muhammad_Sarwar":"God commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. God's advice is the most noble. He sees and hears everything.","Mohsin_Khan":"Verily! Allah commands that you should render back the trusts to those, to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All­Hearer, All­Seer.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":552,"chapter":4,"verse":59,"Sahih_International":"O you who have believed, obey Allah and obey the Messenger and those in authority among you. And if you disagree over anything, refer it to Allah and the Messenger, if you should believe in Allah and the Last Day. That is the best [way] and best in result.","Yusuf_Ali":"O ye who believe! Obey Allah, and obey the Messenger, and those charged with authority among you. If ye differ in anything among yourselves, refer it to Allah and His Messenger, if ye do believe in Allah and the Last Day: That is best, and most suitable for final determination.","Shakir":"O you who believe! obey Allah and obey the Messenger and those in authority from among you; then if you quarrel about anything, refer it to Allah and the Messenger, if you believe in Allah and the last day; this is better and very good in the end.","Muhammad_Sarwar":"Believers, obey God, His Messenger, and your (qualified) leaders. If you have faith in God and the Day of Judgment, refer to God and His Messenger concerning matters in which you differ. This would be a more virtuous and a better way of settling differences.","Mohsin_Khan":"O you who believe! Obey Allah and obey the Messenger (Muhammad SAW), and those of you (Muslims) who are in authority. (And) if you differ in anything amongst yourselves, refer it to Allah and His Messenger (SAW), if you believe in Allah and in the Last Day. That is better and more suitable for final determination.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":553,"chapter":4,"verse":60,"Sahih_International":"Have you not seen those who claim to have believed in what was revealed to you, [O Muhammad], and what was revealed before you? They wish to refer legislation to Taghut, while they were commanded to reject it; and Satan wishes to lead them far astray.","Yusuf_Ali":"Hast thou not turned Thy vision to those who declare that they believe in the revelations that have come to thee and to those before thee? Their (real) wish is to resort together for judgment (in their disputes) to the Evil One, though they were ordered to reject him. But Satan's wish is to lead them astray far away (from the right).","Shakir":"Have you not seen those who assert that they believe in what has been revealed to you and what was revealed before you? They desire to summon one another to the judgment of the Shaitan, though they were commanded to deny him, and the Shaitan desires to lead them astray into a remote error.","Muhammad_Sarwar":"(Muhammad), have you seen those who think that they have faith in what is revealed to you and to others before you, yet choose to take their affairs to Satan for judgment even though they are commanded to deny him. Satan wants to lead them far away from the right path.","Mohsin_Khan":"Have you seen those (hyprocrites) who claim that they believe in that which has been sent down to you, and that which was sent down before you, and they wish to go for judgement (in their disputes) to the Taghut (false judges, etc.) while they have been ordered to reject them. But Shaitan (Satan) wishes to lead them far astray.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":554,"chapter":4,"verse":61,"Sahih_International":"And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion.","Yusuf_Ali":"When it is said to them: \"Come to what Allah hath revealed, and to the Messenger\": Thou seest the Hypocrites avert their faces from thee in disgust.","Shakir":"And when it is said to them: Come to what Allah has revealed and to the Messenger, you will see the hypocrites turning away from you with (utter) aversion.","Muhammad_Sarwar":"When the (hypocrites) are told to refer to God's revelations and to the Messenger, they try to find excuses to stay away from you (Muhammad).","Mohsin_Khan":"And when it is said to them: \"Come to what Allah has sent down and to the Messenger (Muhammad SAW),\" you (Muhammad SAW) see the hypocrites turn away from you (Muhammad SAW) with aversion.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":555,"chapter":4,"verse":62,"Sahih_International":"So how [will it be] when disaster strikes them because of what their hands have put forth and then they come to you swearing by Allah , \"We intended nothing but good conduct and accommodation.\"","Yusuf_Ali":"How then, when they are seized by misfortune, because of the deeds which they hands have sent forth? Then their come to thee, swearing by Allah: \"We meant no more than good-will and conciliation!\"","Shakir":"But how will it be when misfortune befalls them on account of what their hands have sent before? Then they will come to you swearing by Allah: We did not desire (anything) but good and concord.","Muhammad_Sarwar":"What would happen if they were to be afflicted by a disaster brought about by their own hands? They would then come to you swearing by God, \"We only wanted to bring about friendship and reconciliation.\"","Mohsin_Khan":"How then, when a catastrophe befalls them because of what their hands have sent forth, they come to you swearing by Allah, \"We meant no more than goodwill and conciliation!\"","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":556,"chapter":4,"verse":63,"Sahih_International":"Those are the ones of whom Allah knows what is in their hearts, so turn away from them but admonish them and speak to them a far-reaching word.","Yusuf_Ali":"Those men,-Allah knows what is in their hearts; so keep clear of them, but admonish them, and speak to them a word to reach their very souls.","Shakir":"These are they of whom Allah knows what is in their hearts; therefore turn aside from them and admonish them, and speak to them effectual words concerning themselves.","Muhammad_Sarwar":"God knows what is in their hearts. (Muhammad), ignore their faults, advise them, and tell them frankly about what is in their souls.","Mohsin_Khan":"They (hypocrites) are those of whom Allah knows what is in their hearts; so turn aside from them (do not punish them) but admonish them, and speak to them an effective word (i.e. to believe in Allah, worship Him, obey Him, and be afraid of Him) to reach their innerselves.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":557,"chapter":4,"verse":64,"Sahih_International":"And We did not send any messenger except to be obeyed by permission of Allah. And if, when they wronged themselves, they had come to you, [O Muhammad], and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful.","Yusuf_Ali":"We sent not a messenger, but to be obeyed, in accordance with the will of Allah. If they had only, when they were unjust to themselves, come unto thee and asked Allah's forgiveness, and the Messenger had asked forgiveness for them, they would have found Allah indeed Oft-returning, Most Merciful.","Shakir":"And We did not send any messenger but that he should be obeyed by Allah's permission; and had they, when they were unjust to themselves, come to you and asked forgiveness of Allah and the Messenger had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful.","Muhammad_Sarwar":"We did not send any Messengers for any reason other than to be obeyed because of the will of God. If they ever do injustice to themselves and come to you (Muhammad) asking for God's forgiveness and if the Messenger also was to ask God to forgive them, they would certainly find God All-forgiving and All-merciful.","Mohsin_Khan":"We sent no Messenger, but to be obeyed by Allah's Leave. If they (hypocrites), when they had been unjust to themselves, had come to you (Muhammad SAW) and begged Allah's Forgiveness, and the Messenger had begged forgiveness for them: indeed, they would have found Allah All-Forgiving (One Who accepts repentance), Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":558,"chapter":4,"verse":65,"Sahih_International":"But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.","Yusuf_Ali":"But no, by the Lord, they can have no (real) Faith, until they make thee judge in all disputes between them, and find in their souls no resistance against Thy decisions, but accept them with the fullest conviction.","Shakir":"But no! by your Lord! they do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them, and then do not find any straitness in their hearts as to what you have decided and submit with entire submission.","Muhammad_Sarwar":"I swear by your Lord that they will not be considered believers until they let you judge their disputes and then they will find nothing in their souls to prevent them from accepting your judgment, thus, submitting themselves to the will of God.","Mohsin_Khan":"But no, by your Lord, they can have no Faith, until they make you (O Muhammad SAW) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":559,"chapter":4,"verse":66,"Sahih_International":"And if We had decreed upon them, \"Kill yourselves\" or \"Leave your homes,\" they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].","Yusuf_Ali":"If We had ordered them to sacrifice their lives or to leave their homes, very few of them would have done it: But if they had done what they were (actually) told, it would have been best for them, and would have gone farthest to strengthen their (faith);","Shakir":"And if We had prescribed for them: Lay down your lives or go forth from your homes, they would not have done it except a few of them; and if they had done what they were admonished, it would have certainly been better for them and best in strengthening (them);","Muhammad_Sarwar":"Had We commanded them to kill themselves or abandon their homes, only a few of them would have done it. If they had done what they had been advised to do, it would have strengthened their faith,","Mohsin_Khan":"And if We had ordered them (saying), \"Kill yourselves (i.e. the innnocent ones kill the guilty ones) or leave your homes,\" very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their (Faith);","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":560,"chapter":4,"verse":67,"Sahih_International":"And then We would have given them from Us a great reward.","Yusuf_Ali":"And We should then have given them from our presence a great reward;","Shakir":"And then We would certainly have given them from Ourselves a great reward.","Muhammad_Sarwar":"We would have given them a great reward","Mohsin_Khan":"And indeed We should then have bestowed upon them a great reward from Ourselves.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":561,"chapter":4,"verse":68,"Sahih_International":"And We would have guided them to a straight path.","Yusuf_Ali":"And We should have shown them the Straight Way.","Shakir":"And We would certainly have guided them in the right path.","Muhammad_Sarwar":"and guided them to the right path.","Mohsin_Khan":"And indeed We should have guided them to a Straight Way.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":562,"chapter":4,"verse":69,"Sahih_International":"And whoever obeys Allah and the Messenger - those will be with the ones upon whom Allah has bestowed favor of the prophets, the steadfast affirmers of truth, the martyrs and the righteous. And excellent are those as companions.","Yusuf_Ali":"All who obey Allah and the messenger are in the company of those on whom is the Grace of Allah,- of the prophets (who teach), the sincere (lovers of Truth), the witnesses (who testify), and the Righteous (who do good): Ah! what a beautiful fellowship!","Shakir":"And whoever obeys Allah and the Messenger, these are with those upon whom Allah has bestowed favors from among the prophets and the truthful and the martyrs and the good, and a goodly company are they!","Muhammad_Sarwar":"One who obeys God and the Messenger is the friend of the Prophets, saints, martyrs, and the righteous ones to whom God has granted His favors. They are the best friends that one can have.","Mohsin_Khan":"And whoso obeys Allah and the Messenger (Muhammad SAW), then they will be in the company of those on whom Allah has bestowed His Grace, of the Prophets, the Siddiqun (those followers of the Prophets who were first and foremost to believe in them, like Abu Bakr As­Siddiq radhiallahu'anhu), the martyrs, and the righteous. And how excellent these companions are!","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":563,"chapter":4,"verse":70,"Sahih_International":"That is the bounty from Allah , and sufficient is Allah as Knower.","Yusuf_Ali":"Such is the bounty from Allah: And sufficient is it that Allah knoweth all.","Shakir":"This is grace from Allah, and sufficient is Allah as the Knower.","Muhammad_Sarwar":"The favors of God are such, and He knows very well (how to reward you).","Mohsin_Khan":"Such is the Bounty from Allah, and Allah is Sufficient as All­Knower.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":564,"chapter":4,"verse":71,"Sahih_International":"O you who have believed, take your precaution and [either] go forth in companies or go forth all together.","Yusuf_Ali":"O ye who believe! Take your precautions, and either go forth in parties or go forth all together.","Shakir":"O you who believe! take your precaution, then go forth in detachments or go forth in a body.","Muhammad_Sarwar":"Believers, always be well prepared and on your guard. March in small groups or all together.","Mohsin_Khan":"O you who believe! Take your precautions, and either go forth (on an expedition) in parties, or go forth all together.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":565,"chapter":4,"verse":72,"Sahih_International":"And indeed, there is among you he who lingers behind; and if disaster strikes you, he says, \" Allah has favored me in that I was not present with them.\"","Yusuf_Ali":"There are certainly among you men who would tarry behind: If a misfortune befalls you, they say: \"Allah did favour us in that we were not present among them.\"","Shakir":"And surely among you is he who would certainly hang back! If then a misfortune befalls you he says: Surely Allah conferred a benefit on me that I was not present with them.","Muhammad_Sarwar":"There are some among you who lag behind (in battle) and if you were to experience hardship, they would say, \"It was certainly due to God's favors to us that we were not present with them,\"","Mohsin_Khan":"There is certainly among you he who would linger behind (from fighting in Allah's Cause). If a misfortune befalls you, he says, \"Indeed Allah has favoured me in that I was not present among them.\"","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":566,"chapter":4,"verse":73,"Sahih_International":"But if bounty comes to you from Allah , he will surely say, as if there had never been between you and him any affection. \"Oh, I wish I had been with them so I could have attained a great attainment.\"","Yusuf_Ali":"But if good fortune comes to you from Allah, they would be sure to say - as if there had never been Ties of affection between you and them - \"Oh! I wish I had been with them; a fine thing should I then have made of it!\"","Shakir":"And if grace from Allah come to you, he would certainly cry out, as if there had not been any friendship between you and him: Would that I had been with them, then I should have attained a mighty good fortune.","Muhammad_Sarwar":"but if you were to receive a favor from God, they would certainly say, \"(We have been ignored) as if there was no friendship among us. Would that we had been there with them for we would have had a great success.\"","Mohsin_Khan":"But if a bounty (victory and booty) comes to you from Allah, he would surely say - as if there had never been ties of affection between you and him - \"Oh! I wish I had been with them; then I would have achieved a great success ( a good share of booty).\"","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":567,"chapter":4,"verse":74,"Sahih_International":"So let those fight in the cause of Allah who sell the life of this world for the Hereafter. And he who fights in the cause of Allah and is killed or achieves victory - We will bestow upon him a great reward.","Yusuf_Ali":"Let those fight in the cause of Allah Who sell the life of this world for the hereafter. To him who fighteth in the cause of Allah,- whether he is slain or gets victory - Soon shall We give him a reward of great (value).","Shakir":"Therefore let those fight in the way of Allah, who sell this world's life for the hereafter; and whoever fights in the way of Allah, then be he slain or be he victorious, We shall grant him a mighty reward.","Muhammad_Sarwar":"Those who want to buy the life hereafter with this life should fight for the cause of God. We will give them a great reward whether they are killed or whether they are victorious.","Mohsin_Khan":"Let those (believers) who sell the life of this world for the Hereafter fight in the Cause of Allah, and whoso fights in the Cause of Allah, and is killed or gets victory, We shall bestow on him a great reward.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":568,"chapter":4,"verse":75,"Sahih_International":"And what is [the matter] with you that you fight not in the cause of Allah and [for] the oppressed among men, women, and children who say, \"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\"","Yusuf_Ali":"And why should ye not fight in the cause of Allah and of those who, being weak, are ill-treated (and oppressed)?- Men, women, and children, whose cry is: \"Our Lord! Rescue us from this town, whose people are oppressors; and raise for us from thee one who will protect; and raise for us from thee one who will help!\"","Shakir":"And what reason have you that you should not fight in the way of Allah and of the weak among the men and the women and the children, (of) those who say: Our Lord! cause us to go forth from this town, whose people are oppressors, and give us from Thee a guardian and give us from Thee a helper.","Muhammad_Sarwar":"Why do you not fight for the cause of God or save the helpless men, women, and children who cry out, \"Lord, set us free from this town of wrong doers and send us a guardian and a helper?\"","Mohsin_Khan":"And what is wrong with you that you fight not in the Cause of Allah, and for those weak, ill­treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":569,"chapter":4,"verse":76,"Sahih_International":"Those who believe fight in the cause of Allah , and those who disbelieve fight in the cause of Taghut. So fight against the allies of Satan. Indeed, the plot of Satan has ever been weak.","Yusuf_Ali":"Those who believe fight in the cause of Allah, and those who reject Faith Fight in the cause of Evil: So fight ye against the friends of Satan: feeble indeed is the cunning of Satan.","Shakir":"Those who believe fight in the way of Allah, and those who disbelieve fight in the way of the Shaitan. Fight therefore against the friends of the Shaitan; surely the strategy of the Shaitan is weak.","Muhammad_Sarwar":"The believers fight for the cause of God. The unbelievers fight for the cause of the Satan. So fight against the friends of Satan for the evil plans of Satan are certainly weak.","Mohsin_Khan":"Those who believe, fight in the Cause of Allah, and those who disbelieve, fight in the cause of Taghut (Satan, etc.). So fight you against the friends of Shaitan (Satan); Ever feeble indeed is the plot of Shaitan (Satan).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":570,"chapter":4,"verse":77,"Sahih_International":"Have you not seen those who were told, \"Restrain your hands [from fighting] and establish prayer and give zakah\"? But then when fighting was ordained for them, at once a party of them feared men as they fear Allah or with [even] greater fear. They said, \"Our Lord, why have You decreed upon us fighting? If only You had postponed [it for] us for a short time.\" Say, The enjoyment of this world is little, and the Hereafter is better for he who fears Allah. And injustice will not be done to you, [even] as much as a thread [inside a date seed].\"","Yusuf_Ali":"Hast thou not turned Thy vision to those who were told to hold back their hands (from fight) but establish regular prayers and spend in regular charity? When (at length) the order for fighting was issued to them, behold! a section of them feared men as - or even more than - they should have feared Allah: They said: \"Our Lord! Why hast Thou ordered us to fight? Wouldst Thou not Grant us respite to our (natural) term, near (enough)?\" Say: \"Short is the enjoyment of this world: the Hereafter is the best for those who do right: Never will ye be dealt with unjustly in the very least!","Shakir":"Have you not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poor-rate; but when fighting is prescribed for them, lo! a party of them fear men as they ought to have feared Allah, or (even) with a greater fear, and say: Our Lord! why hast Thou ordained fighting for us? Wherefore didst Thou not grant us a delay to a near end? Say: The provision of this world is short, and the hereafter is better for him who guards (against evil); and you shall not be wronged the husk of a date stone.","Muhammad_Sarwar":"Have you not seen those who were told to stop fighting, to say their prayers, and pay the religious tax? When they were ordered to fight, some of them feared other men as much as or more than they feared God and so they said, \"Lord, why have you ordered us to fight? If only you would give us a little time.\" (Muhammad), tell them, \"The pleasures of the worldly life are trivial. The life hereafter is best for the pious ones. You will not be treated the slightest bit unjustly.","Mohsin_Khan":"Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salat (Iqamat­as­Salat), and give Zakat, but when the fighting was ordained for them, behold! a section of them fear men as they fear Allah or even more. They say: \"Our Lord! Why have you ordained for us fighting? Would that you had granted us respite for a short period?\" Say: \"Short is the enjoyment of this world. The Hereafter is (far) better for him who fears Allah, and you shall not be dealt with unjustly even equal to the Fatila (a scalish thread in the long slit of a date­stone).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":571,"chapter":4,"verse":78,"Sahih_International":"Wherever you may be, death will overtake you, even if you should be within towers of lofty construction. But if good comes to them, they say, \"This is from Allah \"; and if evil befalls them, they say, \"This is from you.\" Say, \"All [things] are from Allah.\" So what is [the matter] with those people that they can hardly understand any statement?","Yusuf_Ali":"\"Wherever ye are, death will find you out, even if ye are in towers built up strong and high!\" If some good befalls them, they say, \"This is from Allah\"; but if evil, they say, \"This is from thee\" (O Prophet). Say: \"All things are from Allah.\" But what hath come to these people, that they fail to understand a single fact?","Shakir":"Wherever you are, death will overtake you, though you are in lofty towers, and if a benefit comes to them, they say: This is from Allah; and if a misfortune befalls them, they say: This is from you. Say: All is from Allah, but what is the matter with these people that they do not make approach to understanding what is told (them)?","Muhammad_Sarwar":"Wherever you are, death will find you even if you hide yourselves in firmly constructed towers. Whenever people experience good fortune, they say that it is from God but whenever they experience misfortune, they say it is because of you, (Muhammad). Tell them, \"Everything is from God.\" What is wrong with these people that they do not even try to understand?","Mohsin_Khan":"\"Wheresoever you may be, death will overtake you even if you are in fortresses built up strong and high!\" And if some good reaches them, they say, \"This is from Allah,\" but if some evil befalls them, they say, \"This is from you (O Muhammad SAW).\" Say: \"All things are from Allah,\" so what is wrong with these people that they fail to understand any word?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":572,"chapter":4,"verse":79,"Sahih_International":"What comes to you of good is from Allah , but what comes to you of evil, [O man], is from yourself. And We have sent you, [O Muhammad], to the people as a messenger, and sufficient is Allah as Witness.","Yusuf_Ali":"Whatever good, (O man!) happens to thee, is from Allah; but whatever evil happens to thee, is from thy (own) soul. and We have sent thee as a messenger to (instruct) mankind. And enough is Allah for a witness.","Shakir":"Whatever benefit comes to you (O man!), it is from Allah, and whatever misfortune befalls you, it is from yourself, and We have sent you (O Prophet!), to mankind as a messenger; and Allah is sufficient as a witness.","Muhammad_Sarwar":"Whatever good you may receive is certainly from God and whatever you suffer is from yourselves. We have sent you, (Muhammad), as a Messenger to people. God is a Sufficient witness to your truthfulness.","Mohsin_Khan":"Whatever of good reaches you, is from Allah, but whatever of evil befalls you, is from yourself. And We have sent you (O Muhammad SAW) as a Messenger to mankind, and Allah is Sufficient as a Witness.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":573,"chapter":4,"verse":80,"Sahih_International":"He who obeys the Messenger has obeyed Allah ; but those who turn away - We have not sent you over them as a guardian.","Yusuf_Ali":"He who obeys the Messenger, obeys Allah: But if any turn away, We have not sent thee to watch over their (evil deeds).","Shakir":"Whoever obeys the Messenger, he indeed obeys Allah, and whoever turns back, so We have not sent you as a keeper over them.","Muhammad_Sarwar":"One who obeys the Messenger has certainly obeyed God. You have not been sent to watch over those who turn away from you.","Mohsin_Khan":"He who obeys the Messenger (Muhammad SAW), has indeed obeyed Allah, but he who turns away, then we have not sent you (O Muhammad SAW) as a watcher over them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":574,"chapter":4,"verse":81,"Sahih_International":"And they say, \"[We pledge] obedience.\" But when they leave you, a group of them spend the night determining to do other than what you say. But Allah records what they plan by night. So leave them alone and rely upon Allah. And sufficient is Allah as Disposer of affairs.","Yusuf_Ali":"They have \"Obedience\" on their lips; but when they leave thee, a section of them Meditate all night on things very different from what thou tellest them. But Allah records their nightly (plots): So keep clear of them, and put thy trust in Allah, and enough is Allah as a disposer of affairs.","Shakir":"And they say: Obedience. But when they go out from your presence, a party of them decide by night upon doing otherwise than what you say; and Allah writes down what they decide by night, therefore turn aside from them and trust in Allah, and Allah is sufficient as a protector.","Muhammad_Sarwar":"They proclaim obedience to you but as soon as they leave at night, a group of them make secret plans to do the contrary of what you have told them to do. God keeps the record of their nocturnal plans. Therefore, leave them alone and put your trust in God; He is Sufficient for you as your Guardian.","Mohsin_Khan":"They say: \"We are obedient,\" but when they leave you (Muhammad SAW), a section of them spend all night in planning other than what you say. But Allah records their nightly (plots). So turn aside from them (do not punish them), and put your trust in Allah. And Allah is Ever All­Sufficient as a Disposer of affairs.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":575,"chapter":4,"verse":82,"Sahih_International":"Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah , they would have found within it much contradiction.","Yusuf_Ali":"Do they not consider the Qur'an (with care)? Had it been from other Than Allah, they would surely have found therein Much discrepancy.","Shakir":"Do they not then meditate on the Quran? And if it were from any other than Allah, they would have found in it many a discrepancy.","Muhammad_Sarwar":"Will they not ponder on the Quran? Had it not come from someone other than God, they would have certainly found therein many contradictions.","Mohsin_Khan":"Do they not then consider the Quran carefully? Had it been from other than Allah, they would surely have found therein much contradictions.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":576,"chapter":4,"verse":83,"Sahih_International":"And when there comes to them information about [public] security or fear, they spread it around. But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known about it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.","Yusuf_Ali":"When there comes to them some matter touching (Public) safety or fear, they divulge it. If they had only referred it to the Messenger, or to those charged with authority among them, the proper investigators would have Tested it from them (direct). Were it not for the Grace and Mercy of Allah unto you, all but a few of you would have fallen into the clutches of Satan.","Shakir":"And when there comes to them news of security or fear they spread it abroad; and if they had referred it to the Messenger and to those in authority among them, those among them who can search out the knowledge of it would have known it, and were it not for the grace of Allah upon you and His mercy, you would have certainly followed the Shaitan save a few","Muhammad_Sarwar":"When they receive any news of peace or war, they announce it in public. Had they told it to the Messenger or to their (qualified) leaders, they could have used that information more properly. Were it not for the favor and mercy of God, all but a few of them would have followed Satan.","Mohsin_Khan":"When there comes to them some matter touching (public) safety or fear, they make it known (among the people), if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the Grace and Mercy of Allah upon you, you would have followed Shaitan (Satan), save a few of you.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":577,"chapter":4,"verse":84,"Sahih_International":"So fight, [O Muhammad], in the cause of Allah ; you are not held responsible except for yourself. And encourage the believers [to join you] that perhaps Allah will restrain the [military] might of those who disbelieve. And Allah is greater in might and stronger in [exemplary] punishment.","Yusuf_Ali":"Then fight in Allah's cause - Thou art held responsible only for thyself - and rouse the believers. It may be that Allah will restrain the fury of the Unbelievers; for Allah is the strongest in might and in punishment.","Shakir":"Fight then in Allah's way; this is not imposed on you except In relation to yourself, and rouse the believers to ardor maybe Allah will restrain the fighting of those who disbelieve and Allah is strongest in prowess and strongest to give an exemplary punishment.","Muhammad_Sarwar":"Thus, (Muhammad), fight for the cause of God. You are only responsible for yourself. Rouse the believers and perhaps God will stop the evil designs of the unbelievers. God's punishment and retribution is the most severe.","Mohsin_Khan":"Then fight (O Muhammad SAW) in the Cause of Allah, you are not tasked (held responsible) except for yourself, and incite the believers (to fight along with you), it may be that Allah will restrain the evil might of the disbelievers. And Allah is Stronger in Might and Stronger in punishing.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":578,"chapter":4,"verse":85,"Sahih_International":"Whoever intercedes for a good cause will have a reward therefrom; and whoever intercedes for an evil cause will have a burden therefrom. And ever is Allah , over all things, a Keeper.","Yusuf_Ali":"Whoever recommends and helps a good cause becomes a partner therein: And whoever recommends and helps an evil cause, shares in its burden: And Allah hath power over all things.","Shakir":"Whoever joins himself (to another) in a good cause shall have a share of it, and whoever joins himself (to another) in an evil cause shall have the responsibility of it, and Allah controls all things.","Muhammad_Sarwar":"Whoever intercedes for a good purpose will receive his share of the reward but the intercession for an evil purpose only adds more to one's burden. God has control over all things.","Mohsin_Khan":"Whosoever intercedes for a good cause will have the reward thereof, and whosoever intercedes for an evil cause will have a share in its burden. And Allah is Ever All-Able to do (and also an All-Witness to) everything.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":579,"chapter":4,"verse":86,"Sahih_International":"And when you are greeted with a greeting, greet [in return] with one better than it or [at least] return it [in a like manner]. Indeed, Allah is ever, over all things, an Accountant.","Yusuf_Ali":"When a (courteous) greeting is offered you, meet it with a greeting still more courteous, or (at least) of equal courtesy. Allah takes careful account of all things.","Shakir":"And when you are greeted with a greeting, greet with a better (greeting) than it or return it; surely Allah takes account of all things.","Muhammad_Sarwar":"Answer a greeting in kinder words than those said to you in the greeting or at least as kind. God keeps account of all things.","Mohsin_Khan":"When you are greeted with a greeting, greet in return with what is better than it, or (at least) return it equally. Certainly, Allah is Ever a Careful Account Taker of all things.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":580,"chapter":4,"verse":87,"Sahih_International":"Allah - there is no deity except Him. He will surely assemble you for [account on] the Day of Resurrection, about which there is no doubt. And who is more truthful than Allah in statement.","Yusuf_Ali":"Allah! There is no god but He: of a surety He will gather you together against the Day of Judgment, about which there is no doubt. And whose word can be truer than Allah's?","Shakir":"Allah, there is no god but He-- He will most certainly gather you together on the resurrection day, there is no doubt in it; and who is more true in word than Allah?","Muhammad_Sarwar":"God exists. He is the only Lord. He will gather you all together on the Day of Judgment which will certainly come. Who is more truthful than God?","Mohsin_Khan":"Allah! La ilaha illa Huwa (none has the right to be worshipped but He). Surely, He will gather you together on the Day of Resurrection about which there is no doubt. And who is truer in statement than Allah?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":581,"chapter":4,"verse":88,"Sahih_International":"What is [the matter] with you [that you are] two groups concerning the hypocrites, while Allah has made them fall back [into error and disbelief] for what they earned. Do you wish to guide those whom Allah has sent astray? And he whom Allah sends astray - never will you find for him a way [of guidance].","Yusuf_Ali":"Why should ye be divided into two parties about the Hypocrites? Allah hath upset them for their (evil) deeds. Would ye guide those whom Allah hath thrown out of the Way? For those whom Allah hath thrown out of the Way, never shalt thou find the Way.","Shakir":"What is the matter with you, then, that you have become two parties about the hypocrites, while Allah has made them return (to unbelief) for what they have earned? Do you wish to guide him whom Allah has caused to err? And whomsoever Allah causes to err, you shall by no means find a way for him.","Muhammad_Sarwar":"Why are you divided into two different parties concerning the hypocrites, when God Himself has turned them to disbelief because of their misdeeds. Do you want to guide those whom God has caused to go astray? You cannot find guidance for those whom God has made to err.","Mohsin_Khan":"Then what is the matter with you that you are divided into two parties about the hypocrites? Allah has cast them back (to disbelief) because of what they have earned. Do you want to guide him whom Allah has made to go astray? And he whom Allah has made to go astray, you will never find for him any way (of guidance).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":582,"chapter":4,"verse":89,"Sahih_International":"They wish you would disbelieve as they disbelieved so you would be alike. So do not take from among them allies until they emigrate for the cause of Allah. But if they turn away, then seize them and kill them wherever you find them and take not from among them any ally or helper.","Yusuf_Ali":"They but wish that ye should reject Faith, as they do, and thus be on the same footing (as they): But take not friends from their ranks until they flee in the way of Allah (From what is forbidden). But if they turn renegades, seize them and slay them wherever ye find them; and (in any case) take no friends or helpers from their ranks;-","Shakir":"They desire that you should disbelieve as they have disbelieved, so that you might be (all) alike; therefore take not from among them friends until they fly (their homes) in Allah's way; but if they turn back, then seize them and kill them wherever you find them, and take not from among them a friend or a helper.","Muhammad_Sarwar":"They wish you to become unbelievers as they themselves are. Do not establish friendship with them until they have abandoned their homes for the cause of God. If they betray you, seize them and slay them wherever you find them. Do not establish friendship with them or seek their help","Mohsin_Khan":"They wish that you reject Faith, as they have rejected (Faith), and thus that you all become equal (like one another). So take not Auliya' (protectors or friends) from them, till they emigrate in the Way of Allah (to Muhammad SAW). But if they turn back (from Islam), take (hold) of them and kill them wherever you find them, and take neither Auliya' (protectors or friends) nor helpers from them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":583,"chapter":4,"verse":90,"Sahih_International":"Except for those who take refuge with a people between yourselves and whom is a treaty or those who come to you, their hearts strained at [the prospect of] fighting you or fighting their own people. And if Allah had willed, He could have given them power over you, and they would have fought you. So if they remove themselves from you and do not fight you and offer you peace, then Allah has not made for you a cause [for fighting] against them.","Yusuf_Ali":"Except those who join a group between whom and you there is a treaty (of peace), or those who approach you with hearts restraining them from fighting you as well as fighting their own people. If Allah had pleased, He could have given them power over you, and they would have fought you: Therefore if they withdraw from you but fight you not, and (instead) send you (Guarantees of) peace, then Allah Hath opened no way for you (to war against them).","Shakir":"Except those who reach a people between whom and you there is an alliance, or who come to you, their hearts shrinking from fighting you or fighting their own people; and if Allah had pleased, He would have given them power over you, so that they should have certainly fought you; therefore if they withdraw from you and do not fight you and offer you peace, then Allah has not given you a way against them.","Muhammad_Sarwar":"except with those who attach themselves to your allies or come to you with no desire to fight you or their own people. God could have given them power to fight you. Thus, if they retreat, stop fighting and come forward expressing faith in Islam God will not allow you to fight them.","Mohsin_Khan":"Except those who join a group, between you and whom there is a treaty (of peace), or those who approach you with their breasts restraining from fighting you as well as fighting their own people. Had Allah willed, indeed He would have given them power over you, and they would have fought you. So if they withdraw from you, and fight not against you, and offer you peace, then Allah has opened no way for you against them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":584,"chapter":4,"verse":91,"Sahih_International":"You will find others who wish to obtain security from you and [to] obtain security from their people. Every time they are returned to [the influence of] disbelief, they fall back into it. So if they do not withdraw from you or offer you peace or restrain their hands, then seize them and kill them wherever you overtake them. And those - We have made for you against them a clear authorization.","Yusuf_Ali":"Others you will find that wish to gain your confidence as well as that of their people: Every time they are sent back to temptation, they succumb thereto: if they withdraw not from you nor give you (guarantees) of peace besides restraining their hands, seize them and slay them wherever ye get them: In their case We have provided you with a clear argument against them.","Shakir":"You will find others who desire that they should be safe from you and secure from their own people; as often as they are sent back to the mischief they get thrown into it headlong; therefore if they do not withdraw from you, and (do not) offer you peace and restrain their hands, then seize them and kill them wherever you find them; and against these We have given you a clear authority.","Muhammad_Sarwar":"You will soon find others who seek security from you as well as from their own people, but when they are invited to return to idol worship, they do so enthusiastically. Thus, if they do not keep away from you nor come forward with a peace proposal nor desist from harming you, apprehend and slay them wherever you find them, for We have given you full control over them.","Mohsin_Khan":"You will find others that wish to have security from you and security from their people. Every time they are sent back to temptation, they yield thereto. If they withdraw not from you, nor offer you peace, nor restrain their hands, take (hold) of them and kill them wherever you find them. In their case, We have provided you with a clear warrant against them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":585,"chapter":4,"verse":92,"Sahih_International":"And never is it for a believer to kill a believer except by mistake. And whoever kills a believer by mistake - then the freeing of a believing slave and a compensation payment presented to the deceased's family [is required] unless they give [up their right as] charity. But if the deceased was from a people at war with you and he was a believer - then [only] the freeing of a believing slave; and if he was from a people with whom you have a treaty - then a compensation payment presented to his family and the freeing of a believing slave. And whoever does not find [one or cannot afford to buy one] - then [instead], a fast for two months consecutively, [seeking] acceptance of repentance from Allah. And Allah is ever Knowing and Wise.","Yusuf_Ali":"Never should a believer kill a believer; but (If it so happens) by mistake, (Compensation is due): If one (so) kills a believer, it is ordained that he should free a believing slave, and pay compensation to the deceased's family, unless they remit it freely. If the deceased belonged to a people at war with you, and he was a believer, the freeing of a believing slave (Is enough). If he belonged to a people with whom ye have treaty of Mutual alliance, compensation should be paid to his family, and a believing slave be freed. For those who find this beyond their means, (is prescribed) a fast for two months running: by way of repentance to Allah: for Allah hath all knowledge and all wisdom.","Shakir":"And it does not behoove a believer to kill a believer except by mistake, and whoever kills a believer by mistake, he should free a believing slave, and blood-money should be paid to his people unless they remit it as alms; but if he be from a tribe hostile to you and he is a believer, the freeing of a believing slave (suffices), and if he is from a tribe between whom and you there is a convenant, the blood-money should be paid to his people along with the freeing of a believing slave; but he who cannot find (a slave) should fast for two months successively: a penance from Allah, and Allah is Knowing, Wise.","Muhammad_Sarwar":"A believer cannot slay another believer except by mistake for which the retaliation is to set free a believing slave and pay the appointed blood money to the relatives of the deceased unless the relatives wave aside the payment. If the person slain is from your enemies but himself is a believer, the penalty is to set free a believing slave. If the person slain is one of those with whom you have a peace treaty, the penalty is the same as that for a slain believer. If this is not possible, the defendant has to fast for two consecutive months, asking God to accept his repentance. He is All-knowing and All-wise.","Mohsin_Khan":"It is not for a believer to kill a believer except (that it be) by mistake, and whosoever kills a believer by mistake, (it is ordained that) he must set free a believing slave and a compensation (blood money, i.e Diya) be given to the deceased's family, unless they remit it. If the deceased belonged to a people at war with you and he was a believer; the freeing of a believing slave (is prescribed), and if he belonged to a people with whom you have a treaty of mutual alliance, compensation (blood money - Diya) must be paid to his family, and a believing slave must be freed. And whoso finds this (the penance of freeing a slave) beyond his means, he must fast for two consecutive months in order to seek repentance from Allah. And Allah is Ever All­Knowing, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":586,"chapter":4,"verse":93,"Sahih_International":"But whoever kills a believer intentionally - his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and has prepared for him a great punishment.","Yusuf_Ali":"If a man kills a believer intentionally, his recompense is Hell, to abide therein (For ever): And the wrath and the curse of Allah are upon him, and a dreadful penalty is prepared for him.","Shakir":"And whoever kills a believer intentionally, his punishment is hell; he shall abide in it, and Allah will send His wrath on him and curse him and prepare for him a painful chastisement.","Muhammad_Sarwar":"The punishment for one who purposely slays a believer will be to live in hell fire forever. God is angry with him and has condemned him. He has prepared for him a great torment.","Mohsin_Khan":"And whoever kills a believer intentionally, his recompense is Hell to abide therein, and the Wrath and the Curse of Allah are upon him, and a great punishment is prepared for him.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":587,"chapter":4,"verse":94,"Sahih_International":"O you who have believed, when you go forth [to fight] in the cause of Allah , investigate; and do not say to one who gives you [a greeting of] peace \"You are not a believer,\" aspiring for the goods of worldly life; for with Allah are many acquisitions. You [yourselves] were like that before; then Allah conferred His favor upon you, so investigate. Indeed Allah is ever, with what you do, Acquainted.","Yusuf_Ali":"O ye who believe! When ye go abroad in the cause of Allah, investigate carefully, and say not to any one who offers you a salutation: \"Thou art none of a believer!\" Coveting the perishable goods of this life: with Allah are profits and spoils abundant. Even thus were ye yourselves before, till Allah conferred on you His favours: Therefore carefully investigate. For Allah is well aware of all that ye do.","Shakir":"O you who believe! when you go to war in Allah's way, make investigation, and do not say to any one who offers you peace: You are not a believer. Do you seek goods of this world's life! But with Allah there are abundant gains; you too were such before, then Allah conferred a benefit on you; therefore make investigation; surely Allah is aware of what you do.","Muhammad_Sarwar":"Believers, if you march with arms for the cause of God, make sure that you know whom to fight. Do not accuse anyone who claims himself to be a Muslim of disbelief just for worldly gains. There is abundant bounty with God. Before, you were also like them, but God bestowed His favors upon you. Thus, make sure that you know whom to fight. God is Well Aware of what you do.","Mohsin_Khan":"O you who believe! When you go (to fight) in the Cause of Allah, verify (the truth), and say not to anyone who greets you (by embracing Islam): \"You are not a believer\"; seeking the perishable goods of the worldly life. There are much more profits and booties with Allah. Even as he is now, so were you yourselves before till Allah conferred on you His Favours (i.e. guided you to Islam), therefore, be cautious in discrimination. Allah is Ever Well­Aware of what you do.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":588,"chapter":4,"verse":95,"Sahih_International":"Not equal are those believers remaining [at home] - other than the disabled - and the mujahideen, [who strive and fight] in the cause of Allah with their wealth and their lives. Allah has preferred the mujahideen through their wealth and their lives over those who remain [behind], by degrees. And to both Allah has promised the best [reward]. But Allah has preferred the mujahideen over those who remain [behind] with a great reward -","Yusuf_Ali":"Not equal are those believers who sit (at home) and receive no hurt, and those who strive and fight in the cause of Allah with their goods and their persons. Allah hath granted a grade higher to those who strive and fight with their goods and persons than to those who sit (at home). Unto all (in Faith) Hath Allah promised good: But those who strive and fight Hath He distinguished above those who sit (at home) by a special reward,-","Shakir":"The holders back from among the believers, not having any injury, and those who strive hard in Allah's way with their property and their persons are not equal; Allah has made the strivers with their property and their persons to excel the holders back a (high) degree, and to each (class) Allah has promised good; and Allah shall grant to the strivers above the holders back a mighty reward:","Muhammad_Sarwar":"Among the believers, those who stay at home without a good reason are not equal to those who strive for the cause of God in person or with their property. To those who strive for His cause in person or with their property, God has granted a higher rank than to those who stay at home. God has promised that everyone will receive his proper share of the reward but He will grant a much greater reward to those striving for His cause than to those who stay home (for no reason).","Mohsin_Khan":"Not equal are those of the believers who sit (at home), except those who are disabled (by injury or are blind or lame, etc.), and those who strive hard and fight in the Cause of Allah with their wealth and their lives. Allah has preferred in grades those who strive hard and fight with their wealth and their lives above those who sit (at home). Unto each, Allah has promised good (Paradise), but Allah has preferred those who strive hard and fight, above those who sit (at home) by a huge reward;","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":589,"chapter":4,"verse":96,"Sahih_International":"Degrees [of high position] from Him and forgiveness and mercy. And Allah is ever Forgiving and Merciful.","Yusuf_Ali":"Ranks specially bestowed by Him, and Forgiveness and Mercy. For Allah is Oft-forgiving, Most Merciful.","Shakir":"(High) degrees from Him and protection and mercy, and Allah is Forgiving, Merciful.","Muhammad_Sarwar":"God will grant those who strive high ranks, forgiveness, and mercy. He is All-forgiving and All-merciful.","Mohsin_Khan":"Degrees of (higher) grades from Him, and Forgiveness and Mercy. And Allah is Ever Oft­Forgiving, Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":590,"chapter":4,"verse":97,"Sahih_International":"Indeed, those whom the angels take [in death] while wronging themselves - [the angels] will say, \"In what [condition] were you?\" They will say, \"We were oppressed in the land.\" The angels will say, \"Was not the earth of Allah spacious [enough] for you to emigrate therein?\" For those, their refuge is Hell - and evil it is as a destination.","Yusuf_Ali":"When angels take the souls of those who die in sin against their souls, they say: \"In what (plight) Were ye?\" They reply: \"Weak and oppressed Were we in the earth.\" They say: \"Was not the earth of Allah spacious enough for you to move yourselves away (From evil)?\" Such men will find their abode in Hell,- What an evil refuge! -","Shakir":"Surely (as for) those whom the angels cause to die while they are unjust to their souls, they shall say: In what state were you? They shall say: We were weak in the earth. They shall say: Was not Allah's earth spacious, so that you should have migrated therein? So these it is whose abode is hell, and it is an evil resort","Muhammad_Sarwar":"When the angels take away from their bodies the souls of those who have wronged themselves, they will ask them, \"How did you live?\" They will reply, \"We lived on earth in weakness and oppression.\" The angels will say, \"Was not God's land vast enough for you to go wherever you could live in peace?\" The dwelling of these people will be hell fire, a terrible destination.","Mohsin_Khan":"Verily! As for those whom the angels take (in death) while they are wronging themselves (as they stayed among the disbelievers even though emigration was obligatory for them), they (angels) say (to them): \"In what (condition) were you?\" They reply: \"We were weak and oppressed on earth.\" They (angels) say: \"Was not the earth of Allah spacious enough for you to emigrate therein?\" Such men will find their abode in Hell - What an evil destination!","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":591,"chapter":4,"verse":98,"Sahih_International":"Except for the oppressed among men, women and children who cannot devise a plan nor are they directed to a way -","Yusuf_Ali":"Except those who are (really) weak and oppressed - men, women, and children - who have no means in their power, nor (a guide-post) to their way.","Shakir":"Except the weak from among the men and the children who have not in their power the means nor can they find a way (to escape);","Muhammad_Sarwar":"As for the really weak and oppressed men, women, and children who were not able to find any means of obtaining their freedom or of having the right guidance,","Mohsin_Khan":"Except the weak ones among men, women and children who cannot devise a plan, nor are they able to direct their way.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":592,"chapter":4,"verse":99,"Sahih_International":"For those it is expected that Allah will pardon them, and Allah is ever Pardoning and Forgiving.","Yusuf_Ali":"For these, there is hope that Allah will forgive: For Allah doth blot out (sins) and forgive again and again.","Shakir":"So these, it may be, Allah will pardon them, and Allah is Pardoning, Forgiving.","Muhammad_Sarwar":"perhaps God will forgive them; He is All-merciful and All-forgiving.","Mohsin_Khan":"For these there is hope that Allah will forgive them, and Allah is Ever Oft Pardoning, Oft-Forgiving.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":593,"chapter":4,"verse":100,"Sahih_International":"And whoever emigrates for the cause of Allah will find on the earth many [alternative] locations and abundance. And whoever leaves his home as an emigrant to Allah and His Messenger and then death overtakes him - his reward has already become incumbent upon Allah. And Allah is ever Forgiving and Merciful.","Yusuf_Ali":"He who forsakes his home in the cause of Allah, finds in the earth Many a refuge, wide and spacious: Should he die as a refugee from home for Allah and His Messenger, His reward becomes due and sure with Allah: And Allah is Oft-forgiving, Most Merciful.","Shakir":"And whoever flies in Allah's way, he will find in the earth many a place of refuge and abundant resources, and whoever goes forth from his house flying to Allah and His Messenger, and then death overtakes him, his reward is indeed with Allah and Allah is Forgiving, Merciful.","Muhammad_Sarwar":"One who abandons his home for the cause of God will find many places of refuge in the vast land and one who dies, after having abandoned his home to get near to God and His Messenger, will receive his reward from God. God is All-forgiving and All-merciful.","Mohsin_Khan":"He who emigrates (from his home) in the Cause of Allah, will find on earth many dwelling places and plenty to live by. And whosoever leaves his home as an emigrant unto Allah and His Messenger, and death overtakes him, his reward is then surely incumbent upon Allah. And Allah is Ever Oft­Forgiving, Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":594,"chapter":4,"verse":101,"Sahih_International":"And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you. Indeed, the disbelievers are ever to you a clear enemy.","Yusuf_Ali":"When ye travel through the earth, there is no blame on you if ye shorten your prayers, for fear the Unbelievers May attack you: For the Unbelievers are unto you open enemies.","Shakir":"And when you journey in the earth, there is no blame on you if you shorten the prayer, if you fear that those who disbelieve will cause you distress, surely the unbelievers are your open enemy.","Muhammad_Sarwar":"When you are on a journey, it is no sin to shorten your prayers if you are afraid of the mischief of the unbelievers. The unbelievers have always been your sworn enemies","Mohsin_Khan":"And when you (Muslims) travel in the land, there is no sin on you if you shorten your Salat (prayer) if you fear that the disbelievers may attack you, verily, the disbelievers are ever unto you open enemies.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":595,"chapter":4,"verse":102,"Sahih_International":"And when you are among them and lead them in prayer, let a group of them stand [in prayer] with you and let them carry their arms. And when they have prostrated, let them be [in position] behind you and have the other group come forward which has not [yet] prayed and let them pray with you, taking precaution and carrying their arms. Those who disbelieve wish that you would neglect your weapons and your baggage so they could come down upon you in one [single] attack. But there is no blame upon you, if you are troubled by rain or are ill, for putting down your arms, but take precaution. Indeed, Allah has prepared for the disbelievers a humiliating punishment.","Yusuf_Ali":"When thou (O Messenger) art with them, and standest to lead them in prayer, Let one party of them stand up (in prayer) with thee, Taking their arms with them: When they finish their prostrations, let them Take their position in the rear. And let the other party come up which hath not yet prayed - and let them pray with thee, Taking all precaution, and bearing arms: the Unbelievers wish, if ye were negligent of your arms and your baggage, to assault you in a single rush. But there is no blame on you if ye put away your arms because of the inconvenience of rain or because ye are ill; but take (every) precaution for yourselves. For the Unbelievers Allah hath prepared a humiliating punishment.","Shakir":"And when you are among them and keep up the prayer for them, let a party of them stand up with you, and let them take their arms; then when they have prostrated themselves let them go to your rear, and let another party who have not prayed come forward and pray with you, and let them take their precautions and their arms; (for) those who disbelieve desire that you may be careless of your arms and your luggage, so that they may then turn upon you with a sudden united attack, and there is no blame on you, if you are annoyed with rain or if you are sick, that you lay down your arms, and take your precautions; surely Allah has prepared a disgraceful chastisement for the unbelievers.","Muhammad_Sarwar":"(Muhammad), if you are among them (your followers during a battle) and you call them for prayer, let a group of them carry their arms during prayer. After they have made their prostrations, let them go back to watch the enemy and let the other group who has not yet prayed, join you, carrying their arms with due precaution. The unbelievers would love to find you neglecting your arms and property and would attack you suddenly. If rain or illness make you suffer, you may place your arms aside during prayer but still observe due precaution. God has prepared a humiliating torment for the unbelievers.","Mohsin_Khan":"When you (O Messenger Muhammad SAW) are among them, and lead them in As-Salat (the prayer), let one party of them stand up [in Salat (prayer)] with you taking their arms with them; when they finish their prostrations, let them take their positions in the rear and let the other party come up which has not yet prayed, and let them pray with you taking all the precautions and bearing arms. Those who disbelieve wish, if you were negligent of your arms and your baggage, to attack you in a single rush, but there is no sin on you if you put away your arms because of the inconvenience of rain or because you are ill, but take every precaution for yourselves. Verily, Allah has prepared a humiliating torment for the disbelievers.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":596,"chapter":4,"verse":103,"Sahih_International":"And when you have completed the prayer, remember Allah standing, sitting, or [lying] on your sides. But when you become secure, re-establish [regular] prayer. Indeed, prayer has been decreed upon the believers a decree of specified times.","Yusuf_Ali":"When ye pass (Congregational) prayers, celebrate Allah's praises, standing, sitting down, or lying down on your sides; but when ye are free from danger, set up Regular Prayers: For such prayers are enjoined on believers at stated times.","Shakir":"Then when you have finished the prayer, remember Allah standing and sitting and reclining; but when you are secure (from danger) keep up prayer; surely prayer is a timed ordinance for the believers.","Muhammad_Sarwar":"When you complete your prayer, remember God all the time while standing, sitting, or reclining. When you are safe, say your prayers properly. It is a constant duty of the believers.","Mohsin_Khan":"When you have finished As-Salat (the prayer - congregational), remember Allah standing, sitting down, and lying down on your sides, but when you are free from danger, perform As-Salat (Iqamat­as­ Salat). Verily, the prayer is enjoined on the believers at fixed hours.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":597,"chapter":4,"verse":104,"Sahih_International":"And do not weaken in pursuit of the enemy. If you should be suffering - so are they suffering as you are suffering, but you expect from Allah that which they expect not. And Allah is ever Knowing and Wise.","Yusuf_Ali":"And slacken not in following up the enemy: If ye are suffering hardships, they are suffering similar hardships; but ye have Hope from Allah, while they have none. And Allah is full of knowledge and wisdom.","Shakir":"And be not weak hearted in pursuit of the enemy; if you suffer pain, then surely they (too) suffer pain as you suffer pain, and you hope from Allah what they do not hope; and Allah is Knowing, Wise.","Muhammad_Sarwar":"Do not neglect the pursuit of the enemy. If you have suffered, they too have suffered but you can, at least, expect from God what they can never expect. God is All-knowing and All-wise.","Mohsin_Khan":"And don't be weak in the pursuit of the enemy; if you are suffering (hardships) then surely, they (too) are suffering (hardships) as you are suffering, but you have a hope from Allah (for the reward, i.e. Paradise) that for which they hope not, and Allah is Ever All­Knowing, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":598,"chapter":4,"verse":105,"Sahih_International":"Indeed, We have revealed to you, [O Muhammad], the Book in truth so you may judge between the people by that which Allah has shown you. And do not be for the deceitful an advocate.","Yusuf_Ali":"We have sent down to thee the Book in truth, that thou mightest judge between men, as guided by Allah: so be not (used) as an advocate by those who betray their trust;","Shakir":"Surely We have revealed the Book to you with the truth that you may judge between people by means of that which Allah has taught you; and be not an advocate on behalf of the treacherous.","Muhammad_Sarwar":"We have revealed to you the Book in all Truth so that you judge among people by the laws of God. However, never defend the treacherous ones.","Mohsin_Khan":"Surely, We have sent down to you (O Muhammad SAW) the Book (this Quran) in truth that you might judge between men by that which Allah has shown you (i.e. has taught you through Divine Inspiration), so be not a pleader for the treacherous.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":599,"chapter":4,"verse":106,"Sahih_International":"And seek forgiveness of Allah. Indeed, Allah is ever Forgiving and Merciful.","Yusuf_Ali":"But seek the forgiveness of Allah; for Allah is Oft-forgiving, Most Merciful.","Shakir":"And ask forgiveness of Allah; surely Allah is Forgiving, Merciful.","Muhammad_Sarwar":"Seek forgiveness from God. He is All-forgiving and All-merciful.","Mohsin_Khan":"And seek the Forgiveness of Allah, certainly, Allah is Ever Oft­Forgiving, Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":600,"chapter":4,"verse":107,"Sahih_International":"And do not argue on behalf of those who deceive themselves. Indeed, Allah loves not one who is a habitually sinful deceiver.","Yusuf_Ali":"Contend not on behalf of such as betray their own souls; for Allah loveth not one given to perfidy and crime:","Shakir":"And do not plead on behalf of those who act unfaithfully to their souls; surely Allah does not love him who is treacherous, sinful;","Muhammad_Sarwar":"Do not defend those who deceive themselves; God does not love those who are treacherous and sinful.","Mohsin_Khan":"And argue not on behalf of those who deceive themselves. Verily, Allah does not like anyone who is a betrayer of his trust, and indulges in crime.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":601,"chapter":4,"verse":108,"Sahih_International":"They conceal [their evil intentions and deeds] from the people, but they cannot conceal [them] from Allah , and He is with them [in His knowledge] when they spend the night in such as He does not accept of speech. And ever is Allah , of what they do, encompassing.","Yusuf_Ali":"They may hide (Their crimes) from men, but they cannot hide (Them) from Allah, seeing that He is in their midst when they plot by night, in words that He cannot approve: And Allah Doth compass round all that they do.","Shakir":"They hide themselves from men and do not hide themselves from Allah, and He is with them when they meditate by night words which please Him not, and Allah encompasses what they do.","Muhammad_Sarwar":"They hide their sins from other people but they cannot hide themselves from God who is constantly with them, even when they hold nocturnal meetings, a thing which God does not like. God comprehends all that they do.","Mohsin_Khan":"They may hide (their crimes) from men, but they cannot hide (them) from Allah, for He is with them (by His Knowledge), when they plot by night in words that He does not approve, And Allah ever encompasses what they do.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":602,"chapter":4,"verse":109,"Sahih_International":"Here you are - those who argue on their behalf in [this] worldly life - but who will argue with Allah for them on the Day of Resurrection, or who will [then] be their representative?","Yusuf_Ali":"Ah! These are the sort of men on whose behalf ye may contend in this world; but who will contend with Allah on their behalf on the Day of Judgment, or who will carry their affairs through?","Shakir":"Behold! you are they who (may) plead for them in this world's life, but who will plead for them with Allah on the resurrection day, or who shall be their protector?","Muhammad_Sarwar":"You defend them in this life but who will defend them against God on the Day of Judgment and who will be their attorney?","Mohsin_Khan":"Lo! You are those who have argued for them in the life of this world, but who will argue for them on the Day of Resurrection against Allah, or who will then be their defender?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":603,"chapter":4,"verse":110,"Sahih_International":"And whoever does a wrong or wrongs himself but then seeks forgiveness of Allah will find Allah Forgiving and Merciful.","Yusuf_Ali":"If any one does evil or wrongs his own soul but afterwards seeks Allah's forgiveness, he will find Allah Oft-forgiving, Most Merciful.","Shakir":"And whoever does evil or acts unjustly to his soul, then asks forgiveness of Allah, he shall find Allah Forgiving, Merciful.","Muhammad_Sarwar":"One who commits a sin or does wrong to himself and then seeks forgiveness from God, will find God All-forgiving and All-merciful.","Mohsin_Khan":"And whoever does evil or wrongs himself but afterwards seeks Allah's Forgiveness, he will find Allah Oft­Forgiving, Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":604,"chapter":4,"verse":111,"Sahih_International":"And whoever commits a sin only earns it against himself. And Allah is ever Knowing and Wise.","Yusuf_Ali":"And if any one earns sin. he earns it against His own soul: for Allah is full of knowledge and wisdom.","Shakir":"And whoever commits a sin, he only commits it against his own soul; and Allah is Knowing, Wise.","Muhammad_Sarwar":"One who commits sins has committed them against his own soul. God is All-knowing and All-wise.","Mohsin_Khan":"And whoever earns sin, he earns it only against himself. And Allah is Ever All­Knowing, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":605,"chapter":4,"verse":112,"Sahih_International":"But whoever earns an offense or a sin and then blames it on an innocent [person] has taken upon himself a slander and manifest sin.","Yusuf_Ali":"But if any one earns a fault or a sin and throws it on to one that is innocent, He carries (on himself) (Both) a falsehood and a flagrant sin.","Shakir":"And whoever commits a fault or a sin, then accuses of it one innocent, he indeed takes upon himself the burden of a calumny and a manifest sin.","Muhammad_Sarwar":"One who makes a mistake or commits a sin and ascribes it to an innocent person, he only burdens himself with slander and a grave sin.","Mohsin_Khan":"And whoever earns a fault or a sin and then throws it on to someone innocent, he has indeed burdened himself with falsehood and a manifest sin.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":606,"chapter":4,"verse":113,"Sahih_International":"And if it was not for the favor of Allah upon you, [O Muhammad], and His mercy, a group of them would have determined to mislead you. But they do not mislead except themselves, and they will not harm you at all. And Allah has revealed to you the Book and wisdom and has taught you that which you did not know. And ever has the favor of Allah upon you been great.","Yusuf_Ali":"But for the Grace of Allah to thee and his Mercy, a party of them would certainly have plotted to lead thee astray. But (in fact) they will only Lead their own souls astray, and to thee they can do no harm in the least. For Allah hath sent down to thee the Book and wisdom and taught thee what thou Knewest not (before): And great is the Grace of Allah unto thee.","Shakir":"And were it not for Allah's grace upon you and His mercy a party of them had certainly designed to bring you to perdition and they do not bring (aught) to perdition but their own souls, and they shall not harm you in any way, and Allah has revealed to you the Book and the wisdom, and He has taught you what you did not know, and Allah's grace on you is very great.","Muhammad_Sarwar":"Were it not for the favor and mercy of God, some of them would have certainly tried to make you (Muhammad) go astray. However, they cannot lead any one astray but themselves nor can they harm you. God has revealed the Book to you, has given you wisdom, and has taught you what you did not know. Certainly God's favor to you has been great.","Mohsin_Khan":"Had not the Grace of Allah and His Mercy been upon you (O Muhammad SAW), a party of them would certainly have made a decision to mislead you, but (in fact) they mislead none except their own selves, and no harm can they do to you in the least. Allah has sent down to you the Book (The Quran), and Al­Hikmah (Islamic laws, knowledge of legal and illegal things i.e. the Prophet's Sunnah - legal ways), and taught you that which you knew not. And Ever Great is the Grace of Allah unto you (O Muhammad SAW).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":607,"chapter":4,"verse":114,"Sahih_International":"No good is there in much of their private conversation, except for those who enjoin charity or that which is right or conciliation between people. And whoever does that seeking means to the approval of Allah - then We are going to give him a great reward.","Yusuf_Ali":"In most of their secret talks there is no good: But if one exhorts to a deed of charity or justice or conciliation between men, (Secrecy is permissible): To him who does this, seeking the good pleasure of Allah, We shall soon give a reward of the highest (value).","Shakir":"There is no good in most of their secret counsels except (in his) who enjoins charity or goodness or reconciliation between people; and whoever does this seeking Allah's pleasure, We will give him a mighty reward.","Muhammad_Sarwar":"There is nothing good in much of their secret talks except for that which is for charity, justice, or for reconciliation among people to seek thereby the pleasure of God for which We will give a great reward.","Mohsin_Khan":"There is no good in most of their secret talks save (in) him who orders Sadaqah (charity in Allah's Cause), or Ma'ruf (Islamic Monotheism and all the good and righteous deeds which Allah has ordained), or conciliation between mankind, and he who does this, seeking the good Pleasure of Allah, We shall give him a great reward.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":608,"chapter":4,"verse":115,"Sahih_International":"And whoever opposes the Messenger after guidance has become clear to him and follows other than the way of the believers - We will give him what he has taken and drive him into Hell, and evil it is as a destination.","Yusuf_Ali":"If anyone contends with the Messenger even after guidance has been plainly conveyed to him, and follows a path other than that becoming to men of Faith, We shall leave him in the path he has chosen, and land him in Hell,- what an evil refuge!","Shakir":"And whoever acts hostilely to the Messenger after that guidance has become manifest to him, and follows other than the way of the believers, We will turn him to that to which he has (himself) turned and make him enter hell; and it is an evil resort.","Muhammad_Sarwar":"Whoever gives the Messenger a hard time, even after having received clear guidance, and follows a path other than that of the believers, will be left alone. We will cast him into hell, a terrible destination.","Mohsin_Khan":"And whoever contradicts and opposes the Messenger (Muhammad SAW) after the right path has been shown clearly to him, and follows other than the believers' way. We shall keep him in the path he has chosen, and burn him in Hell - what an evil destination.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":609,"chapter":4,"verse":116,"Sahih_International":"Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly gone far astray.","Yusuf_Ali":"Allah forgiveth not (The sin of) joining other gods with Him; but He forgiveth whom He pleaseth other sins than this: one who joins other gods with Allah, Hath strayed far, far away (from the right).","Shakir":"Surely Allah does not forgive that anything should be associated with Him, and He forgives what is besides this to whom He pleases; and whoever associates anything with Allah, he indeed strays off into a remote error.","Muhammad_Sarwar":"God will not forgive the sin of considering something equal to Him, but He may forgive the other sins of whomever He wants. One who considers anything equal to God has certainly gone far away from the right path.","Mohsin_Khan":"Verily! Allah forgives not (the sin of) setting up partners in worship with Him, but He forgives whom he pleases sins other than that, and whoever sets up partners in worship with Allah, has indeed strayed far away.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":610,"chapter":4,"verse":117,"Sahih_International":"They call upon instead of Him none but female [deities], and they [actually] call upon none but a rebellious Satan.","Yusuf_Ali":"(The Pagans), leaving Him, call but upon female deities: They call but upon satan the persistent rebel!","Shakir":"They do not call besides Him on anything but idols, and they do not call on anything but a rebellious Shaitan.","Muhammad_Sarwar":"They (the pagans) only worship idols and Satan, the persistent rebel.","Mohsin_Khan":"They (all those who worship others than Allah) invoke nothing but female deities besides Him (Allah), and they invoke nothing but Shaitan (Satan), a persistent rebel!","Sahih_International_tag":["female"],"Sahih_International_found":true,"Yusuf_Ali_tag":["female"],"Yusuf_Ali_found":true,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["female"],"Mohsin_Khan_found":true,"total_found":3,"women_mentioned":true,"controversial":false},{"id":611,"chapter":4,"verse":118,"Sahih_International":"Whom Allah has cursed. For he had said, \"I will surely take from among Your servants a specific portion.","Yusuf_Ali":"Allah did curse him, but he said: \"I will take of Thy servants a portion Marked off;","Shakir":"Allah has cursed him; and he said: Most certainly I will take of Thy servants an appointed portion:","Muhammad_Sarwar":"God condemned Satan when he said, \"I will certainly take my revenge from Your servants.","Mohsin_Khan":"Allah cursed him. And he [Shaitan (Satan)] said: \"I will take an appointed portion of your slaves;","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":612,"chapter":4,"verse":119,"Sahih_International":"And I will mislead them, and I will arouse in them [sinful] desires, and I will command them so they will slit the ears of cattle, and I will command them so they will change the creation of Allah.\" And whoever takes Satan as an ally instead of Allah has certainly sustained a clear loss.","Yusuf_Ali":"\"I will mislead them, and I will create in them false desires; I will order them to slit the ears of cattle, and to deface the (fair) nature created by Allah.\" Whoever, forsaking Allah, takes satan for a friend, hath of a surety suffered a loss that is manifest.","Shakir":"And most certainly I will lead them astray and excite in them vain desires, and bid them so that they shall slit the ears of the cattle, and most certainly I will bid them so that they shall alter Allah's creation; and whoever takes the Shaitan for a guardian rather than Allah he indeed shall suffer a manifest loss.","Muhammad_Sarwar":"I will lead them astray, induce in their hearts prolonged, worldly desires, command them to pierce the ears of their animals, sacrificed for the idols, and order them to change the religion of God.\" One who accepts Satan as his guardian, instead of God, has certainly incurred a great loss upon himself.","Mohsin_Khan":"Verily, I will mislead them, and surely, I will arouse in them false desires; and certainly, I will order them to slit the ears of cattle, and indeed I will order them to change the nature created by Allah.\" And whoever takes Shaitan (Satan) as a Wali (protector or helper) instead of Allah, has surely suffered a manifest loss.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":613,"chapter":4,"verse":120,"Sahih_International":"Satan promises them and arouses desire in them. But Satan does not promise them except delusion.","Yusuf_Ali":"Satan makes them promises, and creates in them false desires; but satan's promises are nothing but deception.","Shakir":"He gives them promises and excites vain desires in them; and the Shaitan does not promise them but to deceive.","Muhammad_Sarwar":"Satan gives them false promises and tempts them to develop longings which can never be realized.","Mohsin_Khan":"He [Shaitan (Satan)] makes promises to them, and arouses in them false desires; and Shaitan's (Satan) promises are nothing but deceptions.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":614,"chapter":4,"verse":121,"Sahih_International":"The refuge of those will be Hell, and they will not find from it an escape.","Yusuf_Ali":"They (his dupes) will have their dwelling in Hell, and from it they will find no way of escape.","Shakir":"These are they whose abode is hell, and they shall not find any refuge from it.","Muhammad_Sarwar":"Such people will dwell in hell fire from which they will not be able to escape.","Mohsin_Khan":"The dwelling of such (people) is Hell, and they will find no way of escape from it.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":615,"chapter":4,"verse":122,"Sahih_International":"But the ones who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they will abide forever. [It is] the promise of Allah , [which is] truth, and who is more truthful than Allah in statement.","Yusuf_Ali":"But those who believe and do deeds of righteousness,- we shall soon admit them to gardens, with rivers flowing beneath,-to dwell therein for ever. Allah's promise is the truth, and whose word can be truer than Allah's?","Shakir":"And (as for) those who believe and do good, We will make them enter into gardens beneath which rivers flow, to abide therein for ever; (it is) a promise of Allah, true (indeed), and who is truer of word than Allah?","Muhammad_Sarwar":"We will admit the righteously striving believers to Paradise wherein streams flow and they will live therein forever. God's promise is true for no one is more truthful than Him.","Mohsin_Khan":"But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to the Gardens under which rivers flow (i.e. in Paradise) to dwell therein forever. Allah's Promise is the Truth, and whose words can be truer than those of Allah? (Of course, none).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":616,"chapter":4,"verse":123,"Sahih_International":"Paradise is not [obtained] by your wishful thinking nor by that of the People of the Scripture. Whoever does a wrong will be recompensed for it, and he will not find besides Allah a protector or a helper.","Yusuf_Ali":"Not your desires, nor those of the People of the Book (can prevail): whoever works evil, will be requited accordingly. Nor will he find, besides Allah, any protector or helper.","Shakir":"(This) shall not be in accordance with your vain desires nor in accordance with the vain desires of the followers of the Book; whoever does evil, he shall be requited with it, and besides Allah he will find for himself neither a guardian nor a helper.","Muhammad_Sarwar":"Believers and People of the Book, wishes alone can never provide you with salvation. Whoever commits evil will be punished accordingly and no one besides God will be his guardian or helper.","Mohsin_Khan":"It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof, and he will not find any protector or helper besides Allah.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":617,"chapter":4,"verse":124,"Sahih_International":"And whoever does righteous deeds, whether male or female, while being a believer - those will enter Paradise and will not be wronged, [even as much as] the speck on a date seed.","Yusuf_Ali":"If any do deeds of righteousness,- be they male or female - and have faith, they will enter Heaven, and not the least injustice will be done to them.","Shakir":"And whoever does good deeds whether male or female and he (or she) is a believer-- these shall enter the garden, and they shall not be dealt with a jot unjustly.","Muhammad_Sarwar":"Any believer, male or female, who acts righteously, will enter Paradise and will not suffer the least bit of injustice.","Mohsin_Khan":"And whoever does righteous good deeds, male or female, and is a true believer in the Oneness of Allah (Muslim), such will enter Paradise and not the least injustice, even to the size of a Naqira (speck on the back of a date­stone), will be done to them.","Sahih_International_tag":["female"],"Sahih_International_found":true,"Yusuf_Ali_tag":["female"],"Yusuf_Ali_found":true,"Shakir_tag":["female","she"],"Shakir_found":true,"Muhammad_Sarwar_tag":["female"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["female"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":618,"chapter":4,"verse":125,"Sahih_International":"And who is better in religion than one who submits himself to Allah while being a doer of good and follows the religion of Abraham, inclining toward truth? And Allah took Abraham as an intimate friend.","Yusuf_Ali":"Who can be better in religion than one who submits his whole self to Allah, does good, and follows the way of Abraham the true in Faith? For Allah did take Abraham for a friend.","Shakir":"And who has a better religion than he who submits himself entirely to Allah? And he is the doer of good (to others) and follows the faith of Ibrahim, the upright one, and Allah took Ibrahim as a friend.","Muhammad_Sarwar":"Whose religion is better than that in which one submits himself to God, behaves righteously, and follows the upright religion of Abraham, God's chosen friend?","Mohsin_Khan":"And who can be better in religion than one who submits his face (himself) to Allah (i.e. follows Allah's Religion of Islamic Monotheism); and he is a Muhsin (a good-doer - see V.2:112). And follows the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism - to worship none but Allah Alone). And Allah did take Ibrahim (Abraham) as a Khalil (an intimate friend).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":619,"chapter":4,"verse":126,"Sahih_International":"And to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah , of all things, encompassing.","Yusuf_Ali":"But to Allah belong all things in the heavens and on earth: And He it is that Encompasseth all things.","Shakir":"And whatever is in the heavens and whatever is in the earth is Allah's; and Allah encompasses all things.","Muhammad_Sarwar":"To God belongs all that is in the heavens and the earth and He has control over all things.","Mohsin_Khan":"And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever Encompassing all things.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":620,"chapter":4,"verse":127,"Sahih_International":"And they request from you, [O Muhammad], a [legal] ruling concerning women. Say, \" Allah gives you a ruling about them and [about] what has been recited to you in the Book concerning the orphan girls to whom you do not give what is decreed for them - and [yet] you desire to marry them - and concerning the oppressed among children and that you maintain for orphans [their rights] in justice.\" And whatever you do of good - indeed, Allah is ever Knowing of it.","Yusuf_Ali":"They ask thy instruction concerning the women say: Allah doth instruct you about them: And (remember) what hath been rehearsed unto you in the Book, concerning the orphans of women to whom ye give not the portions prescribed, and yet whom ye desire to marry, as also concerning the children who are weak and oppressed: that ye stand firm for justice to orphans. There is not a good deed which ye do, but Allah is well-acquainted therewith.","Shakir":"And they ask you a decision about women. Say: Allah makes known to you His decision concerning them, and that which is recited to you in the Book concerning female orphans whom you do not give what is appointed for them while you desire to marry them, and concerning the weak among children, and that you should deal towards orphans with equity; and whatever good you do, Allah surely knows it.","Muhammad_Sarwar":"(Muhammad), they ask you concerning women. Tell them, \"God will instruct you about them, besides that which can be read in the Book, about widows with children, whom you wanted to marry without giving them their due rights and He will instruct you about the rights of the weak and oppressed children. God commands you to maintain justice with the orphans. God knows all about whatever good you do.","Mohsin_Khan":"They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not the prescribed portions (as regards Mahr and inheritance) and yet whom you desire to marry, and (concerning) the children who are weak and oppressed, and that you stand firm for justice to orphans. And whatever good you do, Allah is Ever All­Aware of it.","Sahih_International_tag":["women"],"Sahih_International_found":true,"Yusuf_Ali_tag":["women"],"Yusuf_Ali_found":true,"Shakir_tag":["female","women"],"Shakir_found":true,"Muhammad_Sarwar_tag":["women"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["women"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":621,"chapter":4,"verse":128,"Sahih_International":"And if a woman fears from her husband contempt or evasion, there is no sin upon them if they make terms of settlement between them - and settlement is best. And present in [human] souls is stinginess. But if you do good and fear Allah - then indeed Allah is ever, with what you do, Acquainted.","Yusuf_Ali":"If a wife fears cruelty or desertion on her husband's part, there is no blame on them if they arrange an amicable settlement between themselves; and such settlement is best; even though men's souls are swayed by greed. But if ye do good and practise self-restraint, Allah is well-acquainted with all that ye do.","Shakir":"And if a woman fears ill usage or desertion on the part of her husband, there is no blame on them, if they effect a reconciliation between them, and reconciliation is better, and avarice has been made to be present in the (people's) minds; and if you do good (to others) and guard (against evil), then surely Allah is aware of what you do.","Muhammad_Sarwar":"If a woman is afraid of her husband's ill treatment and desertion, it will be no sin for both of them to reach a reconciliation. Reconciliation is good even though men's souls are swayed by greed. If you act righteously and be pious, God is Well Aware of what you do.","Mohsin_Khan":"And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human inner-selves are swayed by greed. But if you do good and keep away from evil, verily, Allah is Ever Well­Acquainted with what you do.","Sahih_International_tag":["her","woman"],"Sahih_International_found":true,"Yusuf_Ali_tag":["her","wife"],"Yusuf_Ali_found":true,"Shakir_tag":["her","woman"],"Shakir_found":true,"Muhammad_Sarwar_tag":["her","woman"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["her","woman"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":622,"chapter":4,"verse":129,"Sahih_International":"And you will never be able to be equal [in feeling] between wives, even if you should strive [to do so]. So do not incline completely [toward one] and leave another hanging. And if you amend [your affairs] and fear Allah - then indeed, Allah is ever Forgiving and Merciful.","Yusuf_Ali":"Ye are never able to be fair and just as between women, even if it is your ardent desire: But turn not away (from a woman) altogether, so as to leave her (as it were) hanging (in the air). If ye come to a friendly understanding, and practise self-restraint, Allah is Oft-forgiving, Most Merciful.","Shakir":"And you have it not in your power to do justice between wives, even though you may wish (it), but be not disinclined (from one) with total disinclination, so that you leave her as it were in suspense; and if you effect a reconciliation and guard (against evil), then surely Allah is Forgiving, Merciful.","Muhammad_Sarwar":"You will never be able to maintain justice among your wives and love them all equally, no matter how hard you try. Do not give total preference to one of them, leaving the other as if in suspense. If you do bring about reconciliation and maintain piety, God is All-forgiving and All-merciful.","Mohsin_Khan":"You will never be able to do perfect justice between wives even if it is your ardent desire, so do not incline too much to one of them (by giving her more of your time and provision) so as to leave the other hanging (i.e. neither divorced nor married). And if you do justice, and do all that is right and fear Allah by keeping away from all that is wrong, then Allah is Ever Oft­Forgiving, Most Merciful.","Sahih_International_tag":["wives"],"Sahih_International_found":true,"Yusuf_Ali_tag":["her","women","woman"],"Yusuf_Ali_found":true,"Shakir_tag":["her","wives"],"Shakir_found":true,"Muhammad_Sarwar_tag":["wives"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["her","wives"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false},{"id":623,"chapter":4,"verse":130,"Sahih_International":"But if they separate [by divorce], Allah will enrich each [of them] from His abundance. And ever is Allah Encompassing and Wise.","Yusuf_Ali":"But if they disagree (and must part), Allah will provide abundance for all from His all-reaching bounty: for Allah is He that careth for all and is Wise.","Shakir":"And if they separate, Allah will render them both free from want out of His ampleness, and Allah is Ample-giving, Wise.","Muhammad_Sarwar":"If the marriage is terminated, God will make each one of them financially independent. God is Munificent and Wise.","Mohsin_Khan":"But if they separate (by divorce), Allah will provide abundance for everyone of them from His Bounty. And Allah is Ever All­Sufficient for His creatures' need, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":624,"chapter":4,"verse":131,"Sahih_International":"And to Allah belongs whatever is in the heavens and whatever is on the earth. And We have instructed those who were given the Scripture before you and yourselves to fear Allah. But if you disbelieve - then to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah Free of need and Praiseworthy.","Yusuf_Ali":"To Allah belong all things in the heavens and on earth. Verily we have directed the People of the Book before you, and you (o Muslims) to fear Allah. But if ye deny Him, lo! unto Allah belong all things in the heavens and on earth, and Allah is free of all wants, worthy of all praise.","Shakir":"And whatever is in the heavens and whatever is in the earth is Allah's and certainly We enjoined those who were given the Book before you and (We enjoin) you too that you should be careful of (your duty to) Allah; and if you disbelieve, then surely whatever is in the heavens and whatever is in the earth is Allah's and Allah is Self-sufficient, Praise-worthy.","Muhammad_Sarwar":"To God belongs all that is in the heavens and the earth. We have told you and the People of the Book to have fear of God. If you all refuse to believe in Him, know that to God belongs all that is in the heavens and the earth. God is Self-sufficient and Praiseworthy.","Mohsin_Khan":"And to Allah belongs all that is in the heavens and all that is in the earth. And verily, We have recommended to the people of the Scripture before you, and to you (O Muslims) that you (all) fear Allah, and keep your duty to Him, But if you disbelieve, then unto Allah belongs all that is in the heavens and all that is in the earth, and Allah is Ever Rich (Free of all wants), Worthy of all praise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":625,"chapter":4,"verse":132,"Sahih_International":"And to Allah belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.","Yusuf_Ali":"Yea, unto Allah belong all things in the heavens and on earth, and enough is Allah to carry through all affairs.","Shakir":"And whatever is in the heavens and whatever is in the earth is Allah's, and Allah is sufficient as a Protector.","Muhammad_Sarwar":"To God belongs all that is in the heavens and the earth. God is a totally Sufficient Guardian.","Mohsin_Khan":"And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever All­Sufficient as a Disposer of affairs.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":626,"chapter":4,"verse":133,"Sahih_International":"If He wills, He can do away with you, O people, and bring others [in your place]. And ever is Allah competent to do that.","Yusuf_Ali":"If it were His will, He could destroy you, o mankind, and create another race; for He hath power this to do.","Shakir":"If He please, He can make you pass away, O people! and bring others; and Allah has the power to do this.","Muhammad_Sarwar":"Had God wanted He could have destroyed you all and replaced you by another people; He has the power to do so.","Mohsin_Khan":"If He wills, He can take you away, O people, and bring others. And Allah is Ever All­Potent over that.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":627,"chapter":4,"verse":134,"Sahih_International":"Whoever desires the reward of this world - then with Allah is the reward of this world and the Hereafter. And ever is Allah Hearing and Seeing.","Yusuf_Ali":"If any one desires a reward in this life, in Allah's (gift) is the reward (both) of this life and of the hereafter: for Allah is He that heareth and seeth (all things).","Shakir":"Whoever desires the reward of this world, then with Allah is the reward of this world and the hereafter; and Allah is Hearing, Seeing.","Muhammad_Sarwar":"Be it known to those who want worldly rewards that God holds the rewards for this life as well as the life to come. God is All-hearing and All-seeing.","Mohsin_Khan":"Whoever desires a reward in this life of the world, then with Allah (Alone and none else) is the reward of this worldly life and of the Hereafter. And Allah is Ever All­Hearer, All­Seer.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":628,"chapter":4,"verse":135,"Sahih_International":"O you who have believed, be persistently standing firm in justice, witnesses for Allah , even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So follow not [personal] inclination, lest you not be just. And if you distort [your testimony] or refuse [to give it], then indeed Allah is ever, with what you do, Acquainted.","Yusuf_Ali":"O ye who believe! stand out firmly for justice, as witnesses to Allah, even as against yourselves, or your parents, or your kin, and whether it be (against) rich or poor: for Allah can best protect both. Follow not the lusts (of your hearts), lest ye swerve, and if ye distort (justice) or decline to do justice, verily Allah is well-acquainted with all that ye do.","Shakir":"O you who believe! be maintainers of justice, bearers of witness of Allah's sake, though it may be against your own selves or (your) parents or near relatives; if he be rich or poor, Allah is nearer to them both in compassion; therefore do not follow (your) low desires, lest you deviate; and if you swerve or turn aside, then surely Allah is aware of what you do.","Muhammad_Sarwar":"Believers, be the supporters of justice and the testify to what you may have witnessed, for the sake of God, even against yourselves, parents, and relatives; whether it be against the rich or the poor. God must be given preference over them. Let not your desires cause you to commit injustice. If you deviate from the truth in your testimony, or decline to give your testimony at all, know that God is Well Aware of what you do.","Mohsin_Khan":"O you who believe! Stand out firmly for justice, as witnesses to Allah, even though it be against yourselves, or your parents, or your kin, be he rich or poor, Allah is a Better Protector to both (than you). So follow not the lusts (of your hearts), lest you may avoid justice, and if you distort your witness or refuse to give it, verily, Allah is Ever Well­Acquainted with what you do.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":629,"chapter":4,"verse":136,"Sahih_International":"O you who have believed, believe in Allah and His Messenger and the Book that He sent down upon His Messenger and the Scripture which He sent down before. And whoever disbelieves in Allah , His angels, His books, His messengers, and the Last Day has certainly gone far astray.","Yusuf_Ali":"O ye who believe! Believe in Allah and His Messenger, and the scripture which He hath sent to His Messenger and the scripture which He sent to those before (him). Any who denieth Allah, His angels, His Books, His Messengers, and the Day of Judgment, hath gone far, far astray.","Shakir":"O you who believe! believe in Allah and His Messenger and the Book which He has revealed to His Messenger and the Book which He revealed before; and whoever disbelieves in Allah and His angels and His messengers and the last day, he indeed strays off into a remote error.","Muhammad_Sarwar":"Believers, have faith in God and His Messenger, the Book which is revealed to him, and the Bible which has been revealed before. Whoever refuses to believe in God, His angels, Books, Messengers and the Day of Judgment, has gone far away from the right path.","Mohsin_Khan":"O you who believe! Believe in Allah, and His Messenger (Muhammad SAW), and the Book (the Quran) which He has sent down to His Messenger, and the Scripture which He sent down to those before (him), and whosoever disbelieves in Allah, His Angels, His Books, His Messengers, and the Last Day, then indeed he has strayed far away.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":630,"chapter":4,"verse":137,"Sahih_International":"Indeed, those who have believed then disbelieved, then believed, then disbelieved, and then increased in disbelief - never will Allah forgive them, nor will He guide them to a way.","Yusuf_Ali":"Those who believe, then reject faith, then believe (again) and (again) reject faith, and go on increasing in unbelief,- Allah will not forgive them nor guide them nor guide them on the way.","Shakir":"Surely (as for) those who believe then disbelieve, again believe and again disbelieve, then increase in disbelief, Allah will not forgive them nor guide them in the (right) path.","Muhammad_Sarwar":"God will not forgive or guide to the right path those who first believe, then disbelieve, again believe and disbelieve, and then increase their disbelief.","Mohsin_Khan":"Verily, those who believe, then disbelieve, then believe (again), and (again) disbelieve, and go on increasing in disbelief; Allah will not forgive them, nor guide them on the (Right) Way.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":631,"chapter":4,"verse":138,"Sahih_International":"Give tidings to the hypocrites that there is for them a painful punishment -","Yusuf_Ali":"To the Hypocrites give the glad tidings that there is for them (but) a grievous penalty;-","Shakir":"Announce to the hypocrites that they shall have a painful chastisement:","Muhammad_Sarwar":"Tell the hypocrites that for them there will be a painful torment.","Mohsin_Khan":"Give to the hypocrites the tidings that there is for them a painful torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":632,"chapter":4,"verse":139,"Sahih_International":"Those who take disbelievers as allies instead of the believers. Do they seek with them honor [through power]? But indeed, honor belongs to Allah entirely.","Yusuf_Ali":"Yea, to those who take for friends unbelievers rather than believers: is it honour they seek among them? Nay,- all honour is with Allah.","Shakir":"Those who take the unbelievers for guardians rather than believers. Do they seek honor from them? Then surely all honor is for Allah.","Muhammad_Sarwar":"Do those who establish friendship with the disbelievers instead of the believers seek honor? Let them know that all honor belongs to God.","Mohsin_Khan":"Those who take disbelievers for Auliya' (protectors or helpers or friends) instead of believers, do they seek honour, power and glory with them? Verily, then to Allah belongs all honour, power and glory.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":633,"chapter":4,"verse":140,"Sahih_International":"And it has already come down to you in the Book that when you hear the verses of Allah [recited], they are denied [by them] and ridiculed; so do not sit with them until they enter into another conversation. Indeed, you would then be like them. Indeed Allah will gather the hypocrites and disbelievers in Hell all together -","Yusuf_Ali":"Already has He sent you Word in the Book, that when ye hear the signs of Allah held in defiance and ridicule, ye are not to sit with them unless they turn to a different theme: if ye did, ye would be like them. For Allah will collect the hypocrites and those who defy faith - all in Hell:-","Shakir":"And indeed He has revealed to you in the Book that when you hear Allah's communications disbelieved in and mocked at do not sit with them until they enter into some other discourse; surely then you would be like them; surely Allah will gather together the hypocrites and the unbelievers all in hell.","Muhammad_Sarwar":"God has told you (believers) in the Book that when you hear people disbelieving and mocking God's revelations, do not sit with them unless they change the subject. You will become like them. God will gather all the hypocrites and the disbelievers together in hell fire.","Mohsin_Khan":"And it has already been revealed to you in the Book (this Quran) that when you hear the Verses of Allah being denied and mocked at, then sit not with them, until they engage in a talk other than that; (but if you stayed with them) certainly in that case you would be like them. Surely, Allah will collect the hypocrites and disbelievers all together in Hell,","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":634,"chapter":4,"verse":141,"Sahih_International":"Those who wait [and watch] you. Then if you gain a victory from Allah , they say, \"Were we not with you?\" But if the disbelievers have a success, they say [to them], \"Did we not gain the advantage over you, but we protected you from the believers?\" Allah will judge between [all of] you on the Day of Resurrection, and never will Allah give the disbelievers over the believers a way [to overcome them].","Yusuf_Ali":"(These are) the ones who wait and watch about you: if ye do gain a victory from Allah, they say: \"Were we not with you?\"- but if the unbelievers gain a success, they say (to them): \"Did we not gain an advantage over you, and did we not guard you from the believers?\" but Allah will judge betwixt you on the Day of Judgment. And never will Allah grant to the unbelievers a way (to triumphs) over the believers.","Shakir":"Those who wait for (some misfortune to befall) you then If you have a victory from Allah they say: Were we not with you? And if there is a chance for the unbelievers, they say: Did we not acquire the mastery over you and defend you from the believers? So Allah shall Judge between you on the day of resurrection, and Allah will by no means give the unbelievers a way against the believers.","Muhammad_Sarwar":"(The hypocrites) wait and watch. If God grants you victory, they say, \"Did we not help you?\" If the unbelievers are victorious, they say, \"Did we not encourage you not to surrender to the believers and did we not protect you from them?\" God will judge among you on the Day of Judgment. He will never help the disbelievers against the believers.","Mohsin_Khan":"Those (hyprocrites) who wait and watch about you; if you gain a victory from Allah, they say: \"Were we not with you,\" but if the disbelievers gain a success, they say (to them): \"Did we not gain mastery over you and did we not protect you from the believers?\" Allah will judge between you (all) on the Day of Resurrection. And never will Allah grant to the disbelievers a way (to triumph) over the believers.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":635,"chapter":4,"verse":142,"Sahih_International":"Indeed, the hypocrites [think to] deceive Allah , but He is deceiving them. And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little,","Yusuf_Ali":"The Hypocrites - they think they are over-reaching Allah, but He will over-reach them: When they stand up to prayer, they stand without earnestness, to be seen of men, but little do they hold Allah in remembrance;","Shakir":"Surely the hypocrites strive to deceive Allah, and He shall requite their deceit to them, and when they stand up to prayer they stand up sluggishly; they do it only to be seen of men and do not remember Allah save a little.","Muhammad_Sarwar":"The hypocrites try to deceive God but He, in fact, deceives them. They stand up in prayer lazily just to show that they pray, but, in truth they remember God very little.","Mohsin_Khan":"Verily, the hypocrites seek to deceive Allah, but it is He Who deceives them. And when they stand up for As-Salat (the prayer), they stand with laziness and to be seen of men, and they do not remember Allah but little.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":636,"chapter":4,"verse":143,"Sahih_International":"Wavering between them, [belonging] neither to the believers nor to the disbelievers. And whoever Allah leaves astray - never will you find for him a way.","Yusuf_Ali":"(They are) distracted in mind even in the midst of it,- being (sincerely) for neither one group nor for another whom Allah leaves straying,- never wilt thou find for him the way.","Shakir":"Wavering between that (and this), (belonging) neither to these nor to those; and whomsoever Allah causes to err, you shall not find a way for him.","Muhammad_Sarwar":"They are hesitant people belonging to neither side. You can find no other way for one whom God has caused to go astray.","Mohsin_Khan":"(They are) swaying between this and that, belonging neither to these nor to those, and he whom Allah sends astray, you will not find for him a way (to the truth - Islam).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":637,"chapter":4,"verse":144,"Sahih_International":"O you who have believed, do not take the disbelievers as allies instead of the believers. Do you wish to give Allah against yourselves a clear case?","Yusuf_Ali":"O ye who believe! Take not for friends unbelievers rather than believers: Do ye wish to offer Allah an open proof against yourselves?","Shakir":"O you who believe! do not take the unbelievers for friends rather than the believers; do you desire that you should give to Allah a manifest proof against yourselves?","Muhammad_Sarwar":"Believers, do not make unbelievers your intimate friends and supporters rather than believers. Do you want to establish clear evidence against yourselves before God?","Mohsin_Khan":"O you who believe! Take not for Auliya' (protectors or helpers or friends) disbelievers instead of believers. Do you wish to offer Allah a manifest proof against yourselves?","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":638,"chapter":4,"verse":145,"Sahih_International":"Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper -","Yusuf_Ali":"The Hypocrites will be in the lowest depths of the Fire: no helper wilt thou find for them;-","Shakir":"Surely the hypocrites are in the lowest stage of the fire and you shall not find a helper for them.","Muhammad_Sarwar":"The hypocrites will be placed in the lowest bottom of the fire and none of you will ever find a helper for them, except","Mohsin_Khan":"Verily, the hyprocrites will be in the lowest depths (grade) of the Fire; no helper will you find for them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":639,"chapter":4,"verse":146,"Sahih_International":"Except for those who repent, correct themselves, hold fast to Allah , and are sincere in their religion for Allah , for those will be with the believers. And Allah is going to give the believers a great reward.","Yusuf_Ali":"Except for those who repent, mend (their lives) hold fast to Allah, and purify their religion as in Allah's sight: if so they will be (numbered) with the believers. And soon will Allah grant to the believers a reward of immense value.","Shakir":"Except those who repent and amend and hold fast to Allah and are sincere in their religion to Allah, these are with the believers, and Allah will grant the believers a mighty reward.","Muhammad_Sarwar":"those (hypocrites) who have repented, put their trust in God, and sincerely followed only His religion will live with the believers to whom God will give a great reward.","Mohsin_Khan":"Except those who repent (from hypocrisy), do righteous good deeds, hold fast to Allah, and purify their religion for Allah (by worshipping none but Allah, and do good for Allah's sake only, not to show-off), then they will be with the believers. And Allah will grant to the believers a great reward.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":640,"chapter":4,"verse":147,"Sahih_International":"What would Allah do with your punishment if you are grateful and believe? And ever is Allah Appreciative and Knowing.","Yusuf_Ali":"What can Allah gain by your punishment, if ye are grateful and ye believe? Nay, it is Allah that recogniseth (all good), and knoweth all things.","Shakir":"Why should Allah chastise you if you are grateful and believe? And Allah is the Multiplier of rewards, Knowing","Muhammad_Sarwar":"Why should God punish you if you give thanks and believe in Him? God is All-rewarding and All-forgiving.","Mohsin_Khan":"Why should Allah punish you if you have thanked (Him) and have believed in Him. And Allah is Ever All­Appreciative (of good), All­Knowing.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":641,"chapter":4,"verse":148,"Sahih_International":"Allah does not like the public mention of evil except by one who has been wronged. And ever is Allah Hearing and Knowing.","Yusuf_Ali":"Allah loveth not that evil should be noised abroad in public speech, except where injustice hath been done; for Allah is He who heareth and knoweth all things.","Shakir":"Allah does not love the public utterance of hurtful speech unless (it be) by one to whom injustice has been done; and Allah is Hearing, Knowing.","Muhammad_Sarwar":"God does not love public accusation unless one is truly wronged. God is All-hearing and All-knowing.","Mohsin_Khan":"Allah does not like that the evil should be uttered in public except by him who has been wronged. And Allah is Ever All­Hearer, All­Knower.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":642,"chapter":4,"verse":149,"Sahih_International":"If [instead] you show [some] good or conceal it or pardon an offense - indeed, Allah is ever Pardoning and Competent.","Yusuf_Ali":"Whether ye publish a good deed or conceal it or cover evil with pardon, verily Allah doth blot out (sins) and hath power (in the judgment of values).","Shakir":"If you do good openly or do it in secret or pardon an evil then surely Allah is Pardoning, Powerful.","Muhammad_Sarwar":"Whether you act virtuously, in public or in private, or pardon (people's) faults, God is All-forgiving and All-powerful.","Mohsin_Khan":"Whether you (mankind) disclose (by good words of thanks) a good deed (done to you in the form of a favour by someone), or conceal it, or pardon an evil, ... verily, Allah is Ever Oft­Pardoning, All­Powerful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":643,"chapter":4,"verse":150,"Sahih_International":"Indeed, those who disbelieve in Allah and His messengers and wish to discriminate between Allah and His messengers and say, \"We believe in some and disbelieve in others,\" and wish to adopt a way in between -","Yusuf_Ali":"Those who deny Allah and His messengers, and (those who) wish to separate Allah from His messengers, saying: \"We believe in some but reject others\": And (those who) wish to take a course midway,-","Shakir":"Surely those who disbelieve in Allah and His messengers and (those who) desire to make a distinction between Allah and His messengers and say: We believe in some and disbelieve in others, and desire to take a course between (this and) that.","Muhammad_Sarwar":"Those who disbelieve in God and His Messengers try to create differences between God and His Messengers (by rejecting their message). They say, \"We believe in some but not in others.\" Thus, they try to find a middle way","Mohsin_Khan":"Verily, those who disbelieve in Allah and His Messengers and wish to make distinction between Allah and His Messengers (by believing in Allah and disbelieving in His Messengers) saying, \"We believe in some but reject others,\" and wish to adopt a way in between.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":644,"chapter":4,"verse":151,"Sahih_International":"Those are the disbelievers, truly. And We have prepared for the disbelievers a humiliating punishment.","Yusuf_Ali":"They are in truth (equally) unbelievers; and we have prepared for unbelievers a humiliating punishment.","Shakir":"These it is that are truly unbelievers, and We have prepared for the unbelievers a disgraceful chastisement.","Muhammad_Sarwar":"but, in fact, they are unbelievers, and for them We have prepared a humiliating torment.","Mohsin_Khan":"They are in truth disbelievers. And We have prepared for the disbelievers a humiliating torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":645,"chapter":4,"verse":152,"Sahih_International":"But they who believe in Allah and His messengers and do not discriminate between any of them - to those He is going to give their rewards. And ever is Allah Forgiving and Merciful.","Yusuf_Ali":"To those who believe in Allah and His messengers and make no distinction between any of the messengers, we shall soon give their (due) rewards: for Allah is Oft-forgiving, Most Merciful.","Shakir":"And those who believe in Allah and His messengers and do not make a distinction between any of them-- Allah will grant them their rewards; and Allah is Forgiving, Merciful.","Muhammad_Sarwar":"As for those who believe in God and make no distinction between His Messengers, they will receive His reward. God is All-forgiving and All-merciful.","Mohsin_Khan":"And those who believe in Allah and His Messengers and make no distinction between any of them (Messengers), We shall give them their rewards, and Allah is Ever Oft­Forgiving, Most Merciful.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":646,"chapter":4,"verse":153,"Sahih_International":"The People of the Scripture ask you to bring down to them a book from the heaven. But they had asked of Moses [even] greater than that and said, \"Show us Allah outright,\" so the thunderbolt struck them for their wrongdoing. Then they took the calf [for worship] after clear evidences had come to them, and We pardoned that. And We gave Moses a clear authority.","Yusuf_Ali":"The people of the Book ask thee to cause a book to descend to them from heaven: Indeed they asked Moses for an even greater (miracle), for they said: \"Show us Allah in public,\" but they were dazed for their presumption, with thunder and lightning. Yet they worshipped the calf even after clear signs had come to them; even so we forgave them; and gave Moses manifest proofs of authority.","Shakir":"The followers of the Book ask you to bring down to them a book from heaven; so indeed they demanded of Musa a greater thing than that, for they said: Show us Allah manifestly; so the lightning overtook them on account of their injustice. Then they took the calf (for a god), after clear signs had come to them, but We pardoned this; and We gave to Musa clear authority.","Muhammad_Sarwar":"(Muhammad), the People of the Book ask you to make a Book descend to them from the heavens. However, they had asked Moses for things much harder to do than this, by saying, \"Show us God in person.\" Thunder and lightning struck them because of their unjust demands. Despite all the evidence that had come to them, they started to worship the calf, but We forgave them for their sins and gave Moses clear authority.","Mohsin_Khan":"The people of the Scripture (Jews) ask you to cause a book to descend upon them from heaven. Indeed they asked Musa (Moses) for even greater than that, when they said: \"Show us Allah in public,\" but they were struck with thunder clap and lightning for their wickedness. Then they worshipped the calf even after clear proofs, evidences, and signs had come to them. (Even) so We forgave them. And We gave Musa (Moses) a clear proof of authority.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":647,"chapter":4,"verse":154,"Sahih_International":"And We raised over them the mount for [refusal of] their covenant; and We said to them, \"Enter the gate bowing humbly\", and We said to them, \"Do not transgress on the sabbath\", and We took from them a solemn covenant.","Yusuf_Ali":"And for their covenant we raised over them (the towering height) of Mount (Sinai); and (on another occasion) we said: \"Enter the gate with humility\"; and (once again) we commanded them: \"Transgress not in the matter of the sabbath.\" And we took from them a solemn covenant.","Shakir":"And We lifted the mountain (Sainai) over them at (the li taking of the covenant) and We said to them: Enter the door making obeisance; and We said to them: Do not exceed the limits of the Sabbath, and We made with them a firm covenant.","Muhammad_Sarwar":"We raised Mount (Sinai) above them because of Our solemn promise to them. Also, We told them to prostrate themselves when entering the gate (of the holy house) and not to commit transgression on the Sabbath. We made a solemn covenant with them.","Mohsin_Khan":"And for their covenant, We raised over them the Mount and (on the other occasion) We said: \"Enter the gate prostrating (or bowing) with humility;\" and We commanded them: \"Transgress not (by doing worldly works on) the Sabbath (Saturday).\" And We took from them a firm covenant.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":648,"chapter":4,"verse":155,"Sahih_International":"And [We cursed them] for their breaking of the covenant and their disbelief in the signs of Allah and their killing of the prophets without right and their saying, \"Our hearts are wrapped\". Rather, Allah has sealed them because of their disbelief, so they believe not, except for a few.","Yusuf_Ali":"(They have incurred divine displeasure): In that they broke their covenant; that they rejected the signs of Allah; that they slew the Messengers in defiance of right; that they said, \"Our hearts are the wrappings (which preserve Allah's Word; We need no more)\";- Nay, Allah hath set the seal on their hearts for their blasphemy, and little is it they believe;-","Shakir":"Therefore, for their breaking their covenant and their disbelief in the communications of Allah and their killing the prophets wrongfully and their saying: Our hearts are covered; nay! Allah set a seal upon them owing to their unbelief, so they shall not believe except a few.","Muhammad_Sarwar":"However, because of their disbelief, disregard of their covenant, denial of God's revelations, murdering the Prophets without reason, and their saying that their hearts were covered, We sealed up their hearts. Only a few of them believe.","Mohsin_Khan":"Because of their breaking the covenant, and of their rejecting the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, and of their killing the Prophets unjustly, and of their saying: \"Our hearts are wrapped (with coverings, i.e. we do not understand what the Messengers say)\" - nay, Allah has set a seal upon their hearts because of their disbelief, so they believe not but a little.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":649,"chapter":4,"verse":156,"Sahih_International":"And [We cursed them] for their disbelief and their saying against Mary a great slander,","Yusuf_Ali":"That they rejected Faith; that they uttered against Mary a grave false charge;","Shakir":"And for their unbelief and for their having uttered against Marium a grievous calumny.","Muhammad_Sarwar":"Their hearts were also sealed because of their lack of faith, their gravely slanderous accusation against Mary,","Mohsin_Khan":"And because of their (Jews) disbelief and uttering against Maryam (Mary) a grave false charge (that she has committed illegal sexual intercourse);","Sahih_International_tag":["mary"],"Sahih_International_found":true,"Yusuf_Ali_tag":["mary"],"Yusuf_Ali_found":true,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":["mary"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["she","maryam","mary"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":650,"chapter":4,"verse":157,"Sahih_International":"And [for] their saying, \"Indeed, we have killed the Messiah, Jesus, the son of Mary, the messenger of Allah.\" And they did not kill him, nor did they crucify him; but [another] was made to resemble him to them. And indeed, those who differ over it are in doubt about it. They have no knowledge of it except the following of assumption. And they did not kill him, for certain.","Yusuf_Ali":"That they said (in boast), \"We killed Christ Jesus the son of Mary, the Messenger of Allah\";- but they killed him not, nor crucified him, but so it was made to appear to them, and those who differ therein are full of doubts, with no (certain) knowledge, but only conjecture to follow, for of a surety they killed him not:-","Shakir":"And their saying: Surely we have killed the Messiah, Isa son of Marium, the messenger of Allah; and they did not kill him nor did they crucify him, but it appeared to them so (like Isa) and most surely those who differ therein are only in a doubt about it; they have no knowledge respecting it, but only follow a conjecture, and they killed him not for sure.","Muhammad_Sarwar":"and their statement that they murdered Jesus, son of Mary, the Messenger of God, when, in fact, they could not have murdered him or crucified him. They, in fact, murdered someone else by mistake. Even those who disputed (the question of whether or not Jesus was murdered) did not have a shred of evidence. All that they knew about it was mere conjecture. They certainly could not have murdered Jesus.","Mohsin_Khan":"And because of their saying (in boast), \"We killed Messiah 'Iesa (Jesus), son of Maryam (Mary), the Messenger of Allah,\" - but they killed him not, nor crucified him, but the resemblance of 'Iesa (Jesus) was put over another man (and they killed that man), and those who differ therein are full of doubts. They have no (certain) knowledge, they follow nothing but conjecture. For surely; they killed him not [i.e. 'Iesa (Jesus), son of Maryam (Mary) ]:","Sahih_International_tag":["mary"],"Sahih_International_found":true,"Yusuf_Ali_tag":["mary"],"Yusuf_Ali_found":true,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":["mary"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["maryam","mary"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":651,"chapter":4,"verse":158,"Sahih_International":"Rather, Allah raised him to Himself. And ever is Allah Exalted in Might and Wise.","Yusuf_Ali":"Nay, Allah raised him up unto Himself; and Allah is Exalted in Power, Wise;-","Shakir":"Nay! Allah took him up to Himself; and Allah is Mighty, Wise.","Muhammad_Sarwar":"God raised him up to Himself. God is Majestic and All-wise.","Mohsin_Khan":"But Allah raised him ['Iesa (Jesus)] up (with his body and soul) unto Himself (and he is in the heavens). And Allah is Ever All­Powerful, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":652,"chapter":4,"verse":159,"Sahih_International":"And there is none from the People of the Scripture but that he will surely believe in Jesus before his death. And on the Day of Resurrection he will be against them a witness.","Yusuf_Ali":"And there is none of the People of the Book but must believe in him before his death; and on the Day of Judgment he will be a witness against them;-","Shakir":"And there is not one of the followers of the Book but most certainly believes in this before his death, and on the day of resurrection he (Isa) shall be a witness against them.","Muhammad_Sarwar":"There will be no one among the People of the Book who will not believe (a belief of no value) in him (Jesus) before their deaths. On the Day of Judgment, (Jesus) will testify against them.","Mohsin_Khan":"And there is none of the people of the Scripture (Jews and Christians), but must believe in him ['Iesa (Jesus), son of Maryam (Mary), as only a Messenger of Allah and a human being], before his ['Iesa (Jesus) or a Jew's or a Christian's] death (at the time of the appearance of the angel of death). And on the Day of Resurrection, he ['Iesa (Jesus)] will be a witness against them.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":["maryam","mary"],"Mohsin_Khan_found":true,"total_found":1,"women_mentioned":false,"controversial":false},{"id":653,"chapter":4,"verse":160,"Sahih_International":"For wrongdoing on the part of the Jews, We made unlawful for them [certain] good foods which had been lawful to them, and for their averting from the way of Allah many [people],","Yusuf_Ali":"For the iniquity of the Jews We made unlawful for them certain (foods) good and wholesome which had been lawful for them;- in that they hindered many from Allah's Way;-","Shakir":"Wherefore for the iniquity of those who are Jews did We disallow to them the good things which had been made lawful for them and for their hindering many (people) from Allah's way.","Muhammad_Sarwar":"We made unlawful for the Jews certain pure things which had been lawful for them before, because of the injustice which they had committed, their obstructing many people from the way of God,","Mohsin_Khan":"For the wrong­doing of the Jews, We made unlawful to them certain good foods which has been lawful to them, and for their hindering many from Allah's Way;","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":654,"chapter":4,"verse":161,"Sahih_International":"And [for] their taking of usury while they had been forbidden from it, and their consuming of the people's wealth unjustly. And we have prepared for the disbelievers among them a painful punishment.","Yusuf_Ali":"That they took usury, though they were forbidden; and that they devoured men's substance wrongfully;- we have prepared for those among them who reject faith a grievous punishment.","Shakir":"And their taking usury though indeed they were forbidden it and their devouring the property of people falsely, and We have prepared for the unbelievers from among them a painful chastisement.","Muhammad_Sarwar":"their taking usury which was prohibited for them, and their consuming people's property unjustly. For the unbelievers among them, We have prepared a painful torment.","Mohsin_Khan":"And their taking of Riba (usury) though they were forbidden from taking it and their devouring of men's substance wrongfully (bribery, etc.). And We have prepared for the disbelievers among them a painful torment.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":655,"chapter":4,"verse":162,"Sahih_International":"But those firm in knowledge among them and the believers believe in what has been revealed to you, [O Muhammad], and what was revealed before you. And the establishers of prayer [especially] and the givers of zakah and the believers in Allah and the Last Day - those We will give a great reward.","Yusuf_Ali":"But those among them who are well-grounded in knowledge, and the believers, believe in what hath been revealed to thee and what was revealed before thee: And (especially) those who establish regular prayer and practise regular charity and believe in Allah and in the Last Day: To them shall We soon give a great reward.","Shakir":"But the firm in knowledge among them and the believers believe in what has been revealed to. you and what was revealed before you, and those who keep up prayers and those who give the poor-rate and the believers in Allah and the last day, these it is whom We will give a mighty reward.","Muhammad_Sarwar":"However, the learned among them (the Jews) and the faithful believe in what God has revealed to you (Muhammad) and to the others before you and those who are steadfast in prayer, pay their religious tax, and believe in God and the Day of Judgment. They all will receive a great reward from Us.","Mohsin_Khan":"But those among them who are well-grounded in knowledge, and the believers, believe in what has been sent down to you (Muhammad SAW) and what was sent down before you, and those who perform As­Salat (Iqamat-as-Salat), and give Zakat and believe in Allah and in the Last Day, it is they to whom We shall give a great reward.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":656,"chapter":4,"verse":163,"Sahih_International":"Indeed, We have revealed to you, [O Muhammad], as We revealed to Noah and the prophets after him. And we revealed to Abraham, Ishmael, Isaac, Jacob, the Descendants, Jesus, Job, Jonah, Aaron, and Solomon, and to David We gave the book [of Psalms].","Yusuf_Ali":"We have sent thee inspiration, as We sent it to Noah and the Messengers after him: we sent inspiration to Abraham, Isma'il, Isaac, Jacob and the Tribes, to Jesus, Job, Jonah, Aaron, and solomon, and to David We gave the Psalms.","Shakir":"Surely We have revealed to you as We revealed to Nuh, and the prophets after him, and We revealed to Ibrahim and Ismail and Ishaq and Yaqoub and the tribes, and Isa and Ayub and Yunus and Haroun and Sulaiman and We gave to Dawood","Muhammad_Sarwar":"(Muhammad), We have sent revelations to you just as were sent to Noah and the Prophets who lived after him and to Abraham, Ishmael, Isaac, Jacob, his descendants, Jesus, Job, Jonah, Aaron, and Solomon. We gave the Psalms to David.","Mohsin_Khan":"Verily, We have inspired you (O Muhammad SAW) as We inspired Nuh (Noah) and the Prophets after him; We (also) inspired Ibrahim (Abraham), Isma'il (Ishmael), Ishaque (Isaac), Ya'qub (Jacob), and Al­Asbat [the twelve sons of Ya'qub (Jacob)], 'Iesa (Jesus), Ayub (Job), Yunus (Jonah), Harun (Aaron), and Sulaiman (Solomon), and to Dawud (David) We gave the Zabur (Psalms).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":657,"chapter":4,"verse":164,"Sahih_International":"And [We sent] messengers about whom We have related [their stories] to you before and messengers about whom We have not related to you. And Allah spoke to Moses with [direct] speech.","Yusuf_Ali":"Of some messengers We have already told thee the story; of others We have not;- and to Moses Allah spoke direct;-","Shakir":"And (We sent) messengers We have mentioned to you before and messengers we have not mentioned to you; and to Musa, Allah addressed His Word, speaking (to him):","Muhammad_Sarwar":"(We sent revelations to) the Messengers mentioned to you before and also to Messengers who have not been mentioned to you. God spoke to Moses in words.","Mohsin_Khan":"And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, - and to Musa (Moses) Allah spoke directly.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":658,"chapter":4,"verse":165,"Sahih_International":"[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise.","Yusuf_Ali":"Messengers who gave good news as well as warning, that mankind, after (the coming) of the messengers, should have no plea against Allah: For Allah is Exalted in Power, Wise.","Shakir":"(We sent) messengers as the givers of good news and as warners, so that people should not have a plea against Allah after the (coming of) messengers; and Allah is Mighty, Wise.","Muhammad_Sarwar":"The Messengers were sent to give people the glad news (of God's mercy) and warn them (of His punishment) so that the human being would not have any objections against God, after the coming of the Messengers, (that they did not have any knowledge of His mercy and punishment). God is Majestic and All-wise.","Mohsin_Khan":"Messengers as bearers of good news as well as of warning in order that mankind should have no plea against Allah after the Messengers. And Allah is Ever All­Powerful, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":659,"chapter":4,"verse":166,"Sahih_International":"But Allah bears witness to that which He has revealed to you. He has sent it down with His knowledge, and the angels bear witness [as well]. And sufficient is Allah as Witness.","Yusuf_Ali":"But Allah beareth witness that what He hath sent unto thee He hath sent from His (own) knowledge, and the angels bear witness: But enough is Allah for a witness.","Shakir":"But Allah bears witness by what He has revealed to you that He has revealed it with His knowledge, and the angels bear witness (also); and Allah is sufficient as a witness.","Muhammad_Sarwar":"God testifies that whatever He has revealed to you (Muhammad) He has revealed it on purpose and the angels also testify to it but God's testimony alone is Sufficient.","Mohsin_Khan":"But Allah bears witness to that which He has sent down (the Quran) unto you (O Muhammad SAW), He has sent it down with His Knowledge, and the angels bear witness. And Allah is All-Sufficient as a Witness.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":660,"chapter":4,"verse":167,"Sahih_International":"Indeed, those who disbelieve and avert [people] from the way of Allah have certainly gone far astray.","Yusuf_Ali":"Those who reject Faith and keep off (men) from the way of Allah, have verily strayed far, far away from the Path.","Shakir":"Surely (as for) those who disbelieve and hinder (men) from Allah's way, they indeed have strayed off into a remote","Muhammad_Sarwar":"Those who have rejected the faith and have obstructed people from the way of God, have certainly gone far away from the right path.","Mohsin_Khan":"Verily, those who disbelieve [by concealing the truth about Prophet Muhammad SAW and his message of true Islamic Monotheism written with them in the Taurat (Torah) and the Injeel (Gospel)] and prevent (mankind) from the Path of Allah (Islamic Monotheism), they have certainly strayed far away. (Tafsir Al-Qurtubi). (See V.7:157)","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":661,"chapter":4,"verse":168,"Sahih_International":"Indeed, those who disbelieve and commit wrong [or injustice] - never will Allah forgive them, nor will He guide them to a path.","Yusuf_Ali":"Those who reject Faith and do wrong,- Allah will not forgive them nor guide them to any way-","Shakir":"Surely (as for) those who disbelieve and act unjustly Allah will not forgive them nor guide them to a path","Muhammad_Sarwar":"God will not forgive those who have rejected the faith and committed injustice, nor will He guide them to any way","Mohsin_Khan":"Verily, those who disbelieve and did wrong [by concealing the truth about Prophet Muhammad SAW and his message of true Islamic Monotheism written with them in the Taurat (Torah) and the Injeel (Gospel)], Allah will not forgive them, nor will He guide them to any way, - (Tafsir Al-Qurtubi).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":662,"chapter":4,"verse":169,"Sahih_International":"Except the path of Hell; they will abide therein forever. And that, for Allah , is [always] easy.","Yusuf_Ali":"Except the way of Hell, to dwell therein for ever. And this to Allah is easy.","Shakir":"Except the path of hell, to abide in it for ever, and this is easy to Allah.","Muhammad_Sarwar":"other than that of hell wherein they will live forever. For God this is not in the least bit difficult.","Mohsin_Khan":"Except the way of Hell, to dwell therein forever, and this is ever easy for Allah.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":663,"chapter":4,"verse":170,"Sahih_International":"O Mankind, the Messenger has come to you with the truth from your Lord, so believe; it is better for you. But if you disbelieve - then indeed, to Allah belongs whatever is in the heavens and earth. And ever is Allah Knowing and Wise.","Yusuf_Ali":"O Mankind! The Messenger hath come to you in truth from Allah: believe in him: It is best for you. But if ye reject Faith, to Allah belong all things in the heavens and on earth: And Allah is All-knowing, All-wise.","Shakir":"O people! surely the Messenger has come to you with the truth from your Lord, therefore believe, (it shall be) good for you and If you disbelieve, then surely whatever is in the heavens and the earth is Allah's; and Allah is Knowing, Wise.","Muhammad_Sarwar":"Mankind, the Messenger has come to you from your Lord in all Truth. It is for your own good to believe in him, but if you disbelieve, know that to God belongs all that is in the heavens and the earth. God is All-knowing and All-wise.","Mohsin_Khan":"O mankind! Verily, there has come to you the Messenger (Muhammad SAW) with the truth from your Lord, so believe in him, it is better for you. But if you disbelieve, then certainly to Allah belongs all that is in the heavens and the earth. And Allah is Ever All­Knowing, All­Wise.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":664,"chapter":4,"verse":171,"Sahih_International":"O People of the Scripture, do not commit excess in your religion or say about Allah except the truth. The Messiah, Jesus, the son of Mary, was but a messenger of Allah and His word which He directed to Mary and a soul [created at a command] from Him. So believe in Allah and His messengers. And do not say, \"Three\"; desist - it is better for you. Indeed, Allah is but one God. Exalted is He above having a son. To Him belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.","Yusuf_Ali":"O People of the Book! Commit no excesses in your religion: Nor say of Allah aught but the truth. Christ Jesus the son of Mary was (no more than) a messenger of Allah, and His Word, which He bestowed on Mary, and a spirit proceeding from Him: so believe in Allah and His messengers. Say not \"Trinity\" : desist: it will be better for you: for Allah is one Allah: Glory be to Him: (far exalted is He) above having a son. To Him belong all things in the heavens and on earth. And enough is Allah as a Disposer of affairs.","Shakir":"O followers of the Book! do not exceed the limits in your religion, and do not speak (lies) against Allah, but (speak) the truth; the Messiah, Isa son of Marium is only a messenger of Allah and His Word which He communicated to Marium and a spirit from Him; believe therefore in Allah and His messengers, and say not, Three. Desist, it is better for you; Allah is only one Allah; far be It from His glory that He should have a son, whatever is in the heavens and whatever is in the earth is His, and Allah is sufficient for a Protector.","Muhammad_Sarwar":"People of the Book, do not exceed the limits of devotion in your religion or say anything about God which is not the Truth. Jesus, son of Mary, is only a Messenger of God, His Word, and a spirit from Him whom He conveyed to Mary. So have faith in God and His Messengers. Do not say that there are three gods. It is better for you to stop believing in the Trinity. There is only One God. He is too glorious to give birth to a son. To God belongs all that is in the heavens and the earth. God alone is a Sufficient Guardian for all.","Mohsin_Khan":"O people of the Scripture (Jews and Christians)! Do not exceed the limits in your religion, nor say of Allah aught but the truth. The Messiah 'Iesa (Jesus), son of Maryam (Mary), was (no more than) a Messenger of Allah and His Word, (\"Be!\" - and he was) which He bestowed on Maryam (Mary) and a spirit (Ruh) created by Him; so believe in Allah and His Messengers. Say not: \"Three (trinity)!\" Cease! (it is) better for you. For Allah is (the only) One Ilah (God), Glory be to Him (Far Exalted is He) above having a son. To Him belongs all that is in the heavens and all that is in the earth. And Allah is All­Sufficient as a Disposer of affairs.","Sahih_International_tag":["mary"],"Sahih_International_found":true,"Yusuf_Ali_tag":["mary"],"Yusuf_Ali_found":true,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":["mary"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["maryam","mary"],"Mohsin_Khan_found":true,"total_found":4,"women_mentioned":true,"controversial":false},{"id":665,"chapter":4,"verse":172,"Sahih_International":"Never would the Messiah disdain to be a servant of Allah , nor would the angels near [to Him]. And whoever disdains His worship and is arrogant - He will gather them to Himself all together.","Yusuf_Ali":"Christ disdaineth nor to serve and worship Allah, nor do the angels, those nearest (to Allah): those who disdain His worship and are arrogant,-He will gather them all together unto Himself to (answer).","Shakir":"The Messiah does by no means disdain that he should be a servant of Allah, nor do the angels who are near to Him, and whoever disdains His service and is proud, He will gather them all together to Himself.","Muhammad_Sarwar":"Jesus never disdained the worship of God nor did the nearest angels to God. Whoever, out of pride, disdains the worship of God should know that everyone will be brought before Him.","Mohsin_Khan":"The Messiah will never be proud to reject to be a slave to Allah, nor the angels who are near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":666,"chapter":4,"verse":173,"Sahih_International":"And as for those who believed and did righteous deeds, He will give them in full their rewards and grant them extra from His bounty. But as for those who disdained and were arrogant, He will punish them with a painful punishment, and they will not find for themselves besides Allah any protector or helper.","Yusuf_Ali":"But to those who believe and do deeds of righteousness, He will give their (due) rewards,- and more, out of His bounty: But those who are disdainful and arrogant, He will punish with a grievous penalty; Nor will they find, besides Allah, any to protect or help them.","Shakir":"Then as for those who believe and do good, He will pay them fully their rewards and give them more out of His grace; and as for those who disdain and are proud, He will chastise them with a painful chastisement. And they shall not find for themselves besides Allah a guardian or a helper","Muhammad_Sarwar":"The righteously striving believers will receive the reward for their deeds and extra favors from God. But those who disdain the worship of God out of pride will suffer the most painful torment. They will find no guardian or helper besides God.","Mohsin_Khan":"So, as for those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness, He will give their (due) rewards, and more out of His Bounty. But as for those who refuse His worship and were proud, He will punish them with a painful torment . And they will not find for themselves besides Allah any protector or helper.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":667,"chapter":4,"verse":174,"Sahih_International":"O mankind, there has come to you a conclusive proof from your Lord, and We have sent down to you a clear light.","Yusuf_Ali":"O mankind! verily there hath come to you a convincing proof from your Lord: For We have sent unto you a light (that is) manifest.","Shakir":"O people! surely there has come to you manifest proof from your Lord and We have sent to you clear light.","Muhammad_Sarwar":"Mankind, an undeniable proof has certainly come to you and We have sent you a shining light","Mohsin_Khan":"O mankind! Verily, there has come to you a convincing proof (Prophet Muhammad SAW) from your Lord, and We sent down to you a manifest light (this Quran).","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":668,"chapter":4,"verse":175,"Sahih_International":"So those who believe in Allah and hold fast to Him - He will admit them to mercy from Himself and bounty and guide them to Himself on a straight path.","Yusuf_Ali":"Then those who believe in Allah, and hold fast to Him,- soon will He admit them to mercy and grace from Himself, and guide them to Himself by a straight way.","Shakir":"Then as for those who believe in Allah and hold fast by Him, He will cause them to enter into His mercy and grace and guide them to Himself on a right path.","Muhammad_Sarwar":"Those who believe in God and seek His protection will receive His mercy, favors, and His guidance to the right path.","Mohsin_Khan":"So, as for those who believed in Allah and held fast to Him, He will admit them to His Mercy and Grace (i.e. Paradise), and guide them to Himself by a Straight Path.","Sahih_International_tag":[],"Sahih_International_found":false,"Yusuf_Ali_tag":[],"Yusuf_Ali_found":false,"Shakir_tag":[],"Shakir_found":false,"Muhammad_Sarwar_tag":[],"Muhammad_Sarwar_found":false,"Mohsin_Khan_tag":[],"Mohsin_Khan_found":false,"total_found":0,"women_mentioned":false,"controversial":false},{"id":669,"chapter":4,"verse":176,"Sahih_International":"They request from you a [legal] ruling. Say, \" Allah gives you a ruling concerning one having neither descendants nor ascendants [as heirs].\" If a man dies, leaving no child but [only] a sister, she will have half of what he left. And he inherits from her if she [dies and] has no child. But if there are two sisters [or more], they will have two-thirds of what he left. If there are both brothers and sisters, the male will have the share of two females. Allah makes clear to you [His law], lest you go astray. And Allah is Knowing of all things.","Yusuf_Ali":"They ask thee for a legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs. If it is a man that dies, leaving a sister but no child, she shall have half the inheritance: If (such a deceased was) a woman, who left no child, Her brother takes her inheritance: If there are two sisters, they shall have two-thirds of the inheritance (between them): if there are brothers and sisters, (they share), the male having twice the share of the female. Thus doth Allah make clear to you (His law), lest ye err. And Allah hath knowledge of all things.","Shakir":"They ask you for a decision of the law. Say: Allah gives you a decision concerning the person who has neither parents nor offspring; if a man dies (and) he has no son and he has a sister, she shall have half of what he leaves, and he shall be her heir she has no son; but if there be two (sisters), they shall have two-thirds of what he leaves; and if there are brethren, men and women, then the male shall have the like of the portion of two females; Allah makes clear to you, lest you err; and Allah knows all things.","Muhammad_Sarwar":"(Muhammad), they seek your verdict. Tell them, \"God commands this concerning your kindred: If a man dies childless but has a sister, she will receive half of the legacy. If a woman dies childless, her brother will receive the whole legacy. If a childless man leaves only two sisters, both will receive two-thirds of the legacy. If the heirs are both sisters and brothers, the share of a male will be twice as much as the share of the female. God explains His Laws to you so that you will not go astray. God knows all things.","Mohsin_Khan":"They ask you for a legal verdict. Say: \"Allah directs (thus) about Al­Kalalah (those who leave neither descendants nor ascendants as heirs). If it is a man that dies, leaving a sister, but no child, she shall have half the inheritance. If (such a deceased was) a woman, who left no child, her brother takes her inheritance. If there are two sisters, they shall have two-thirds of the inheritance; if there are brothers and sisters, the male will have twice the share of the female. (Thus) does Allah makes clear to you (His Law) lest you go astray. And Allah is the All-Knower of everything.\"","Sahih_International_tag":["sisters","her","sister","she"],"Sahih_International_found":true,"Yusuf_Ali_tag":["woman","her","sister","female","she","sisters"],"Yusuf_Ali_found":true,"Shakir_tag":["her","sister","women","she","sisters"],"Shakir_found":true,"Muhammad_Sarwar_tag":["woman","her","sister","female","she","sisters"],"Muhammad_Sarwar_found":true,"Mohsin_Khan_tag":["woman","her","sister","female","she","sisters"],"Mohsin_Khan_found":true,"total_found":5,"women_mentioned":true,"controversial":false}]